{
    "datasource_id": "Microtech from Milan challenges Zuckerberg and Gates on the metaverse and games  Breaking Latest News@BreakingLatestnews@Meta",
    "data": "Microtech’s challenge on metaverse and games\nDon’t tell Mark Zuckerberg, who wanted to change the way we see the world with his headsets (and maybe he will). Don’t tell that to Bill Gates, who changed the way we play at home with his Xbox, but who had to settle for a few other revolutions. The challenge for the future of augmented reality it now passes through the province of Milan. And precisely from an SME, based in Buccinasco, the Microtech, which from 2019 to 2021 saw its revenues rise from 2.9 million to 19.8 million euros, with an annual growth rate of +90%, while the ebitda rose to 1.6 million.\nThe headset challenge\nFrom this reality, born for the sale and assembly of computers, and which is now establishing itself in the design of innovative technologies, 10,000 visors will be delivered within the year. Unique products in Italy. And similar to those that Zuckerberg distributes for the metaverse, but with a strong imprint on education and with a social soul for the distribution of content. That is, what we can see with the viewers. By the first half of 2024, it will also supply 25,000 interactive monitors for schools with their charging carts. Most of which in Romania. Thanks to the acceleration given by the billion and 800 million euros of funds put on the plate by the Pnrr.\nThe gaming industry\nAnd then there’s the gaming sector, the other asset on which the Milanese company is betting strongly. A market that is worth 92.3 billion dollars worldwide (data from 2022), which has a growth rate of 15% and which in Italy sees 15.5 million people bewitched by consoles. Microtech has created a platform, LudiX, which allows you to build a gaming PC practically by yourself.\nTaking advantage of artificial intelligence and machine learning, it offers over 13 million combinations for your PC. An idea that the big game and electronics chains really liked, starting with Gamestop, which has 270 stores in Italy. The Microtech platform connects directly to the reseller’s website. The customer customizes his own model, places the order, the Milanese company assembles the PC and delivers it to the home or shop for collection. The same distribution agreement was also recently reached with DGgroup, better known for the Expert brand, and with Euronics Tufano.\nFundraising\nTo support this vertical growth, the company has recently launched a campaign on Mamacrowd, aiming to raise 4 million. “With over 112 thousand devices produced and shipped in Italy during 2021, we position ourselves as a leader in the design and development of innovative and versatile electronic devices and digital solutions, with the aim of guaranteeing quality and reliability to our customers by simplifying every single aspect of the complex human-machine interaction – explains Fabio Rifici, managing director of Microtech -. The collection campaign on Mamacrowd will allow us, in addition to marketing the innovative proprietary software platform LudiX on the market, to also support the internationalization process and the consequent strengthening and implementation of specific managerial figures”.\nThe gaming chain\nWith another big project on the horizon. That of creating a network of stores where you can play, support customers, even with an e-coach, and make room for buying and selling. The name of the chain is already there: Ludix. And also the outline of the business plan, which gives a nod to franchising, which foresees a turnover of 2 million a year when fully operational and the recovery of the investment in 5 years."
}