{
    "datasource_id": "Malaysia to take legal action against Meta over harmful content@Reuters@2023-06-24 17:34:29.950321@Meta",
    "data": "KUALA LUMPUR, June 23 (Reuters) - Malaysia said on Friday it will take legal action against Facebook parent Meta Platforms (META.O) for failing to remove \"undesirable\" posts, the strongest measure the country has taken to date over such content.\nPrime Minister Anwar Ibrahim's administration has vowed to curb what it calls provocative posts that touch on race and religion since coming to power in November after a closely fought election in the Southeast Asian nation that has led to a rise in ethnic tensions.\nFacebook has recently been \"plagued by\" a significant volume of undesirable content relating to race, royalty, religion, defamation, impersonation, online gambling and scam advertisements, the Malaysian Communications and Multimedia Commission said in a statement.\nIt said Meta had failed to take sufficient action despite its repeated requests and that legal action was necessary to promote accountability for cybersecurity and to protect consumers.\nMeta did not respond to a request for comment.\nAsked what legal action it might take, the commission said in an emailed statement on Saturday that allowing abuse of network facilities or application services can be offences under Malaysia's Communications and Multimedia Act 1998.\nThe law also allows for officials of the company to be charged for \"wilfully providing means and aiding criminal activity\" if prompt action is not taken, it said.\nRace and religion are thorny issues in Malaysia, which has a majority of Muslim ethnic Malays alongside significant ethnic Chinese and Indian minorities.\nCommentary on the country's revered royals is also a sensitive issue, and negative remarks towards them can be tried under sedition laws.\nThe action against Facebook comes just weeks ahead of elections in six states that are expected to pit Anwar's multi-ethnic coalition against a conservative Malay Muslim alliance.\nFacebook is Malaysia's biggest social media platform, with an estimated 60% of the country's 33 million people having a registered account.\nGlobally, big social media firms that include Meta, Google's YouTube and TikTok are often under regulatory scrutiny over content posted on their platforms.\nSome Southeast Asian governments have frequently requested that content be taken down.\nIn 2020, Vietnam threatened to shut down Facebook in the country if it did not agree to government demands to censor more local political content on its platform. The government said last year that social media platforms operating in Vietnam had removed more than 3,200 posts and videos in the first quarter that contained false information and violated the country's law.\nIn Indonesia, Facebook in 2019 took down hundreds of local accounts, pages and groups linked to a fake news syndicate.\nReporting by A. Ananthalakshmi; Editing Miyoung Kim, Edwina Gibbs and William Mallard\n\n\n\n\n\n\n\nOur Standards: The Thomson Reuters Trust Principles."
}