{
    "datasource_id": "Meta's Facebook pressured by Vietnam's government to censor dissent@The Washington Post@2023-06-19 22:42:09.716918@Meta",
    "data": "Listen 11 min Share this article Share Comment on this story Comment\n\nHANOI — When Facebook took off in Vietnam about a decade ago, it was like a “revolution,” said two of the company’s early employees in Asia. For the first time, people across the country could communicate directly about current affairs. Users posted about police abuse and government waste, poking holes in the propaganda of the ruling Communist Party. “It felt like a liberation,” said one of the Facebook employees, “and we were part of it.”\n\nBut as Facebook’s popularity exploded in Vietnam, soon making this country the company’s seventh largest market worldwide, the government increasingly demanded greater restrictions.\n\nSince then, the social media giant Meta, which owns Facebook, has been making repeated concessions to Vietnam’s authoritarian government, routinely censoring dissent and allowing those seen as threats by the government to be forced off the platform, according to four former Meta employees, human rights groups, industry observers and lobbyists.\n\nAdvertisement\n\nMeta has adopted an internal list of Vietnamese Communist Party officials who should not be criticized on Facebook, said two former employees in Asia, who, like the others, spoke on the condition of anonymity to avoid retribution. This list, which is kept private even within the company and has not been publicly reported on before, is included in guidelines used in controlling online content and was shaped in large part by Vietnamese authorities, the former employees said. They said such a list of names is unique to Vietnam in East Asia.\n\nNow, the government is pushing for even more severe restrictions. Meta is preparing to tighten content controls further after being told by officials in recent months that it would otherwise have to store data on servers inside Vietnam, raising alarms about privacy and information security, according to people with knowledge of the company’s internal discussions.\n\nMeta executives did not respond directly to questions about censorship, the silencing of users or the list of Communist Party officials. In a statement, Rafael Frankel, Meta’s director for public policy in Southeast Asia, said the company is proud of its investments in Vietnam. “Our focus,” he said, “is ensuring as many Vietnamese people as possible are able to use our platform to build community and express themselves.”\n\nAdvertisement\n\nThe company is not unique in removing sensitive content in Vietnam. Since 2019, Google, which owns YouTube, has received more than 2,000 government requests to take down content in Vietnam and has complied with the vast majority of them, according to company data. TikTok says it removed or restricted more than 300 posts in the country last year for violating local law. Both companies said they value free expression.\n\nBut, for many in Vietnam, Facebook is synonymous with the internet. More than 70 percent of the Vietnam’s 97 million people use Facebook to share content, operate businesses and send messages, government data shows. The platform has more users than any other social networking app and dominates digital ad spending, according to the Vietnam E-Commerce Association.\n\nAnd although governments around the world can ask Facebook to take down content, the concessions that Meta has made to preserve its access in Vietnam — the world’s 15th-most-populous country — go well beyond those it has made anywhere else in East Asia, according to consultants and former employees. (Facebook does not operate in China.)\n\nTran Duy Dong, Vietnam’s vice minister of planning and investment, said in an interview that there has been “good cooperation” with Meta over removing “unsuitable” content. “Day by day, they better understand the requirements of Vietnamese law,” he added.\n\n‘These firms will bend’\n\nUntil a few years ago, Vietnamese officials worried that Silicon Valley firms would adopt a hard line on free speech, balking at government requests to control content, according to five foreign and local consultants who are in regular contact with Vietnamese government leaders. That is no longer a concern, the consultants said.\n\nAdvertisement\n\n“The sense now among the Vietnamese is that they tested the limits and they won,” said a consultant who has worked with tech firms in Asia and spoke on the condition of anonymity to protect business interests. “The understanding is that these firms will bend.”\n\nMeta has tracked government censorship requests in Vietnam since 2017, according to its transparency reports. As of June 2022, it had blocked more than 8,000 posts in the country, most for allegedly containing “content opposing the Communist Party and the Government of Vietnam” or information that “distorts, slanders, or insults” organizations or individuals, the reports say.\n\nRestrictions peaked in 2020 with 3,044 removals ahead of Vietnam’s 2021 Communist Party congress, then dipped in 2021. Data has not been released for the past 11 months, but Vietnam’s Ministry of Information said that between April 15 and May 15 of this year, the government deemed more than 400 posts on Facebook to be fraudulent or “anti-state.” Meta removed 91 percent of them, the ministry said.\n\nAdvertisement\n\nMeta said in 2021 that it censors content in Vietnam to avoid being blocked entirely in the country. Frankel, the public policy director, said the company is “proud that our platform has helped tens of thousands of Vietnamese small businesses grow and prosper.”\n\nBefore it became highly censored in Vietnam, Facebook had been one of the only spaces for free expression, recalled Tran Phuong Thao, the wife of Dang Dinh Bach, a Vietnamese environmental lawyer serving a five-year prison sentence on charges of tax evasion. As the platform becomes more restrictive, said Thao, 29, “no one can raise their voice for Bach.”\n\n“I am alone,” she added.\n\nThirteen Vietnamese activists independently said in interviews with The Washington Post that Meta has stepped up censorship since 2017. They told similar stories of being unfairly accused of violating Facebook’s community standards and of their posts taken down or accounts frozen with little explanation.\n\nFrom 2018 to 2021, activists said, some employees in Facebook’s human rights and public policy divisions would field calls for help from users in Vietnam. Many of those lines have now gone dead, activists said.\n\nAdvertisement\n\n“Facebook and our government have done some handshake,” said Dan, 34, an activist who started using Facebook in his 20s. Among his peers, many now behind bars or in hiding, the 10 years spanning 2008 to 2018 were known as the decade of speaking out, he said.\n\nThe years that followed go by a different name: the decade of silence.\n\nFacing a more assertive regime\n\nAcross the world, governments can file takedown requests with Meta for content they deem unlawful. Each request is assessed using country-specific guidelines, and in Vietnam, these include the list of top party officials, said former company employees. These individuals, who left the company between 2018 and 2023, said they shared details of internal operations at Meta because they were concerned about the company’s concessions to Vietnamese authorities and its ability to resist additional pressure from the government after recent layoffs.\n\nAdvertisement\n\nPosts that criticize anyone on this list are generally removed, the former employees said, although some cases are referred to legal and human rights teams for evaluation. Those making decisions recognize the costs to free speech, said one former employee, adding, “No one takes this lightly.”\n\nActivists confirmed that they have consistently seen posts criticizing top officials taken down.\n\nIn 2020, Meta executives told the Los Angeles Times that they push back on takedown requests when authorities go too far. But in the past three years, critics say, the company’s resistance has weakened as the government has grown more repressive.\n\nEmboldened by a conservative faction of the party that has edged out reformists, Vietnam’s security apparatus now wields more power than it has in a decade, academics say. Initially caught on the back foot by the internet’s explosive growth, the regime has asserted control over the digital sphere, enacting a raft of legislation to control content on social media and streaming platforms. Disinformation researchers at Oxford University and elsewhere have found evidence in Vietnam of a 10,000-strong military cyber unit tasked with curbing online criticism.\n\nAdvertisement\n\nLast September, authorities adopted a law drafted by the Ministry of Public Security laying out requirements including that tech companies establish local entities and store data on local servers.\n\nThe threat of localization sparked panic at Meta over data privacy and security, according to former employees. But Vu Tu Thanh, the Vietnam country representative for the US-ASEAN Business Council, said the intention of the law was far more straightforward: to pressure companies to tighten censorship.\n\nIn private meetings, the government has told Meta it will be forced to localize data only if it breaks laws on content, said former employees and tech consultants. In response, Meta has mounted a renewed effort to toughen content controls.\n\nMeta said it does not store data in Vietnam but declined to say whether it plans to do so in the future.\n\nAdvertisement\n\nDespite appeals from rights groups, the Biden administration’s response to Vietnam’s crackdown on free expression has been restrained, said Nguyen Khac Giang, a research fellow focused on Vietnam at the Singapore-based ISEAS Yusof-Ishak Institute. Washington has issued occasional statements but has applied no obvious diplomatic or financial pressure, Giang said, placing a higher priority instead on improving relations with Vietnam as part of confronting China.\n\nCameron Thomas-Shah, a spokesman for the U.S. Embassy in Vietnam, said U.S. officials have “directly, openly and candidly” expressed concerns over human rights.\n\nEuropean Union Ambassador Giorgio Alberti conceded in an interview that Vietnam’s government has not fully abided by its promises to the E.U. to improve human rights. But it would be “myopic,” he added, to fixate on that, given Vietnam’s growing strategic importance.\n\nThe company goes silent\n\nIn 2018, after writing an opinion piece in The Post about Facebook’s being overrun by “troll farms and cyber-army brigades” in Vietnam, the rights activist Mai Khoi, 39, was invited to meet with company representatives in Menlo Park, Calif. She presented examples of pro-government networks abusing Facebook’s platform to target dissidents and urged the company to do more to protect users, she said.\n\nAfter that meeting, Mai Khoi stayed in contact with Meta’s human rights division, she said, alerting it when the accounts of activists she knew were wrongly frozen. But responses from the company slowed, then stopped entirely. She rarely tries anymore, she said.\n\nMeta did not respond to inquiries about Mai Khoi or her appeals to the company.\n\nWith its revenue declining, Meta has laid off tens of thousands of workers worldwide and has allowed the expiry of initiatives, actions that experts warn could affect its ability to deal with issues such as misinformation and regulatory challenges.\n\nIn Asia, a team that had been working with civil society groups to secure elections was recently laid off, along with at least a dozen employees who studied regulations, shaped public policy and tracked government abuses of Meta’s platforms across Southeast Asia, including in Vietnam, said former employees. Several employees who had helped field complaints about censorship from users and organizations in Vietnam were laid off.\n\nThe company said it still has teams working on these issues in Asia. But in Vietnam, some of the platform’s first adopters say it has already strayed too far.\n\nHoang Thi Minh Hong, 51, used to rely on Facebook to organize events and recruit members for her Ho Chi Minh City nonprofit organization focused on climate change. But after her group, CHANGE, was placed on a government blacklist, Hong said, its reach on Facebook dwindled from thousands of users to a handful, and she was barred from buying ads on the platform to promote her events. Last year, she shut it down.\n\n“It was painful because we were building a movement,” Hong said in April, weeks before she was arrested on charges of tax evasion — the same allegations that had been leveled against Bach, the lawyer.\n\n“I wish we could have continued,” Hong said, “I wish Facebook had helped us continue.”\n\nShare"
}