{
    "datasource_id": "Meta's AI program trying to catch up as employees leave: WSJ@Business Insider@2023-06-18 22:42:09.721919@Meta",
    "data": "Since OpenAI launched ChatGPT in November, Meta has lost a third of its published AI researchers, WSJ reports.\n\nThe White House snubbed the Big Tech giant at its May AI leadership summit.\n\nResearchers who left the company cite burnout and a lack of confidence in Meta's direction, reports say.\n\nMorning Brew Insider recommends waking up with, a daily newsletter. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking “Sign Up,” you also agree to marketing emails from both Insider and Morning Brew; and you accept Insider’s Terms and Privacy Policy Click here for Morning Brew’s privacy policy.\n\nAt the helm of Meta, CEO Mark Zuckerberg once invested heavily in the advancement of artificial intelligence, but the tech giant is falling behind competitors in the wake of layoffs and researchers departing the company.\n\nAs AI continues to evolve, Meta is trying to find its footing among industry leaders like OpenAI. The task may prove difficult as the company has lost at least a third of its researchers with published AI work to burnout or lack of faith in Meta over the last year, Wall Street Journal reported.\n\nIn 2013, Zuckerberg recruited Yann LeCun, an AI \"godfather\" to lead Meta's efforts to advance in AI, but the White House left the company off of the guest list for its summit of \"companies at the forefront of AI innovation.\"\n\nToday, the company is working to correct previous missteps that shifted focus away from the generative AI despite employees urging Meta to follow the new direction, WSJ reported.\n\nUnder LeCun, sources told WSJ, AI researchers found it difficult to push for large language models that make programs like ChatGPT possible. Still, in a June town hall meeting with employees, Zuckerberg praised the company for its strides in AI.\n\n\"In the last year, we've seen some really incredible breakthroughs—qualitative breakthroughs—on generative AI,\" he said.\n\nMeta has also lost many researchers in the last year who said they felt burned out or doubtful of the company's future in AI, according to WSJ. When OpenAI released ChatGPT in November and effectively accelerated the race to innovate in AI, even more employees departed. Another AI competitor, image generator Midjourney, has gained attention within a year of launching thanks to viral fake images of Pope Francis and Donald Trump.\n\nIn an internal survey conducted between April 26 and May 10, just 26% of the Meta employees who responded said they felt confident in their company's leadership.\n\nMeta did not immediately respond to Insider's request for comment.\n\nZuckerberg dubbed 2023 the \"year of efficiency\" in a February earnings release. Meta laid off over 11,000 employees in November, and continued to shut down projects in the months that followed."
}