{
    "datasource_id": "Mark Zuckerberg's MMA trainer 'not sure' Meta CEO would beat Elon Musk@Business Insider@2023-06-25 15:34:30.700118@Meta",
    "data": "Elon Musk this week challenged Mark Zuckerberg to go head-to-head in a cage fight.\nThe Meta CEO, who practices Jiu-Jitsu, responded by saying on Instagram: \"Send Me Location.\"\n\"I'm not sure how the fight will play out,\" Zuckerberg's MMA trainer Khai Wu told Forbes.\nMorning Brew Insider recommends waking up with, a daily newsletter. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking “Sign Up,” you also agree to marketing emails from both Insider and Morning Brew; and you accept Insider’s Terms and Privacy Policy Click here for Morning Brew’s privacy policy.\nMark Zuckerberg's mixed martial arts trainer is far from certain that the Meta CEO would win a fight with Elon Musk.\nThe tech mogul told \"The Joe Rogan Experience\" podcast last year that he took up MMA because it required constant focus. Zuckerberg's been training with pro MMA fighter Khai \"The Shadow\" Wu since September last year.\nWeighing in on Zuckerberg's planned showdown with the Tesla CEO, Wu told Forbes: \"I just go and train. I can only speak on how hard he works.\"\nWu, 27, added: \"He works really hard. He's a really nice guy to be honest with you. I'm not sure how the fight will play out, so I don't want to speculate, but I'm like you, I'm like 'how crazy is this?'\"\nWu described the 39-year-old Meta chief as a \"student of the game\" and said he \"shows up, trains hard, puts in the effort.\"\nThe billionaires this week appeared to agree to go head-to-head after Musk challenged Zuckerberg to a cage fight.\nAfter Musk hit out at Meta's rumored plans to launch a Twitter rival, a Twitter user warned him to \"be careful\" because Zuckerberg practices jiu-jitsu.\nMusk tweeted: \"I'm up for a cage match if he is lol.\" Zuckerberg responded on an Instagram story: \"Send Me Location.\"\nThe head of UFC, Dana White, said the pair were \"absolutely dead serious\" about fighting after talking to both on the phone.\nOn a Twitter Space Saturday Musk said: \"I haven't started training yet. If it does happen I will train.\"\nBloomberg's Ashlee Vance, who hosted the Space, warned Musk that it \"could go badly\" because Zuckerberg takes the Brazilian martial art \"pretty seriously.\"\n\nMusk admitted \"that's possible\" and said of the fight plans: \"I think it might actually happen.\""
}