{
    "datasource_id": "Meta Platforms Stock: This Is Enough, I Am Taking Profits Now (NASDAQ:META)@Seeking Alpha@2023-06-19 21:42:10.599101@Meta",
    "data": "Justin Sullivan\n\nShares of Meta Platforms (NASDAQ:META) have appreciated more than 133% since the beginning of the year and the social media company is now the best performer in the FAANG group of stocks. While I still like Meta Platforms and the company’s advertising business, I believe a lot of the firm’s previously indicated recovery potential has now been realized and shares are vulnerable to a correction. Meta Platforms is currently trading at a P/FCF ratio of 43X and no longer undervalued based off of free cash flow. The EPS estimate trend has also reversed and I believe this is a good time to lock in Meta Platforms' profits!\n\nData by YCharts\n\nMassive upside revaluation for shares of Meta Platforms\n\nIf you told me a year ago that Meta Platforms is going to be the best-performing FAANG stock, I would have laughed. Shares of Meta Platforms suffered at the time from a slowdown in the advertising market with companies scaling back ad spending and new social media rivals such as TikTok capturing the attention of younger social media users.\n\nMarket sentiment regarding Meta Platforms has greatly improved in recent months, driving a massive recovery rally for the social media company's shares: META has been by far the best-performing FAANG stock with a return of 216% since the beginning of November 2022... which is when Meta Platforms fell to its last 1-year low at $88.\n\nData by YCharts\n\nAdvertising market recovery now likely fully priced in now\n\nMeta Platforms said that its revenues grew 3% in the first-quarter to $28.65B, thereby reversing a negative top line trend that lasted for three quarters. The last time Meta Platforms saw positive top line growth was in Q1'22 which is when revenues grew 7% year over year. Meta Platforms also saw a profound rebound in its free cash flow in the first-quarter of FY 2023 as the company spent less money on new capital projects and focused on controlling operating costs. The market turned decidedly more bullish on Meta Platforms after the release of first-quarter earnings which indicated that the worst of the advertiser slump was already behind the social media company.\n\nData by YCharts\n\nAccording to InsiderIntelligence, the digital advertising market is expected to rebound in 2024: U.S. digital ad spending is projected to grow 11.2% next year compared to 7.8% in 2023. The expectation of recovering advertising sales is already reflected in growing EPS projections for Meta Platforms. In my opinion, the rebound in the advertising market is already reflected in Meta Platforms' EPS estimates as well as valuation.\n\nSource: InsiderIntelligence.com\n\nMeta Platform's valuation relative to other FAANG stocks\n\nMeta Platforms was a bargain last year when investors panicked about the rise of alternative short video platforms like TikTok and Meta Platforms started to report revenue declines due to marketers pulling back from digital advertising spending. Additionally, Mark Zuckerberg's aggressive bet on the Metaverse was widely mocked, causing investors to question Meta Platforms' capital allocation.\n\nMeta Platforms' EPS trend, however, has started to improve in the first-quarter, in large part because the company focused aggressively on cost cuts and reported its first positive top line growth rate since Q1'22. The reversal in the EPS revision trend also reflects expectations of a rebound in the advertising industry in FY 2024. In the last ninety days, Meta Platforms has seen 27 EPS up-side revisions for FY 2023 compared to 0 down-side revisions, indicating that investor sentiment has changed from extremely bearish in Q4'22 to optimistic/very optimistic in Q2'23.\n\nData by YCharts\n\nExpectations of an improving digital advertising market, positive top line growth in Q1'23, EPS estimate upside momentum, stronger free cash flow margins driven by a cutback in spending and a major $40B stock buyback have driven Meta Platforms' revaluation since November 2022... which is when shares of the social media company cost just 12X earnings. Now, Meta Platforms is valued at a 20X earnings and a 43X free cash flow multiplier. Only Alphabet (GOOG) is currently cheaper (in the FAANG group) than Meta Platforms regarding P/E and, in my opinion, Google is one of the best AI stocks that investors can buy right now. Based off of free cash flow, Meta Platforms is likely more than fairly valued right now.\n\nData by YCharts\n\nRisks with Meta Platforms\n\nThe rise of short term video platforms is a serious risk to Meta Platforms as its user base is aging and younger people move to fresher social media apps. I also see continual investments in Meta Platforms' Metaverse business as a potential cash drain in the short term, although the social media company has started to scale back its investments in Q1'23. What would change my mind about Meta Platforms is if the company saw accelerating top line growth and much stronger free cash flow margins.\n\nFinal thoughts\n\nAfter a 216% valuation gain since November 2022, the time has come for me to take profits. Shares of the social media company are now leaning on being overvalued based off of free cash flow, in my opinion, and the recent EPS revision trend suggests that investors are now very bullish. As a result, I believe Meta Platforms is vulnerable to a correction and that the risk profile is much less favorable than in November of 2022. Since a recovery of the advertising market is now also increasingly reflected in Meta Platforms' valuation, this may be a good time to sell into the strength!"
}