{
    "datasource_id": "Meta Platforms (NASDAQ:META) Sets New 12-Month High at $289.15@Defense World@2023-06-25 12:34:30.700118@Meta",
    "data": "Meta Platforms, Inc. (NASDAQ:META – Get Rating)’s stock price reached a new 52-week high on Friday . The company traded as high as $289.15 and last traded at $288.67, with a volume of 14576430 shares changing hands. The stock had previously closed at $284.88.\nWall Street Analysts Forecast Growth\nA number of research firms have weighed in on META. Edward Jones raised shares of Meta Platforms from a “hold” rating to a “buy” rating in a research report on Monday, March 20th. Monness Crespi & Hardt upped their target price on shares of Meta Platforms from $240.00 to $275.00 and gave the company a “buy” rating in a research note on Thursday, April 27th. Wells Fargo & Company started coverage on shares of Meta Platforms in a research note on Wednesday, June 7th. They issued an “equal weight” rating and a $276.00 target price on the stock. Morgan Stanley upped their target price on shares of Meta Platforms from $250.00 to $300.00 and gave the company an “overweight” rating in a research note on Thursday, April 27th. Finally, Needham & Company LLC reiterated an “underperform” rating on shares of Meta Platforms in a research note on Wednesday, March 8th. Three research analysts have rated the stock with a sell rating, eight have assigned a hold rating, thirty-nine have assigned a buy rating and one has given a strong buy rating to the company’s stock. According to MarketBeat, the stock currently has a consensus rating of “Moderate Buy” and an average price target of $249.07.\nGet Meta Platforms alerts:\nMeta Platforms Price Performance\nThe company has a quick ratio of 2.07, a current ratio of 2.07 and a debt-to-equity ratio of 0.08. The company’s 50 day moving average is $249.66 and its 200 day moving average is $194.01. The firm has a market capitalization of $739.94 billion, a price-to-earnings ratio of 35.82, a P/E/G ratio of 1.07 and a beta of 1.19.\nInsider Transactions at Meta Platforms\nMeta Platforms ( NASDAQ:META Get Rating ) last released its quarterly earnings results on Wednesday, April 26th. The social networking company reported $2.64 EPS for the quarter, beating the consensus estimate of $1.96 by $0.68. Meta Platforms had a net margin of 18.27% and a return on equity of 20.67%. The business had revenue of $28.65 billion for the quarter, compared to the consensus estimate of $27.49 billion. On average, equities research analysts anticipate that Meta Platforms, Inc. will post 11.94 earnings per share for the current fiscal year.\nIn other news, insider Jennifer Newstead sold 722 shares of the stock in a transaction dated Tuesday, June 20th. The shares were sold at an average price of $278.73, for a total value of $201,243.06. Following the completion of the transaction, the insider now owns 35,200 shares of the company’s stock, valued at $9,811,296. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this hyperlink. In other news, COO Javier Olivan sold 4,274 shares of Meta Platforms stock in a transaction on Wednesday, May 17th. The shares were sold at an average price of $239.34, for a total value of $1,022,939.16. Following the completion of the sale, the chief operating officer now owns 74,983 shares in the company, valued at approximately $17,946,431.22. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is accessible through this hyperlink. Also, insider Jennifer Newstead sold 722 shares of the business’s stock in a transaction on Tuesday, June 20th. The shares were sold at an average price of $278.73, for a total transaction of $201,243.06. Following the sale, the insider now owns 35,200 shares of the company’s stock, valued at approximately $9,811,296. The disclosure for this sale can be found here. Over the last 90 days, insiders sold 39,078 shares of company stock valued at $9,240,685. 13.75% of the stock is currently owned by insiders.\nInstitutional Trading of Meta Platforms\nInstitutional investors have recently made changes to their positions in the company. Riverpoint Wealth Management Holdings LLC bought a new stake in shares of Meta Platforms in the 4th quarter worth $25,000. Ruedi Wealth Management Inc. bought a new stake in shares of Meta Platforms in the 4th quarter worth $25,000. NewSquare Capital LLC bought a new stake in shares of Meta Platforms in the 4th quarter worth $26,000. Arcadia Investment Management Corp MI bought a new stake in shares of Meta Platforms in the 4th quarter worth $26,000. Finally, Worth Asset Management LLC boosted its holdings in shares of Meta Platforms by 248.6% in the 1st quarter. Worth Asset Management LLC now owns 122 shares of the social networking company’s stock worth $26,000 after buying an additional 87 shares during the last quarter. Institutional investors own 62.54% of the company’s stock.\nMeta Platforms Company Profile\n(Get Rating)\nMeta Platforms, Inc engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately.\nRecommended Stories\nReceive News & Ratings for Meta Platforms Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Meta Platforms and related companies with MarketBeat.com's FREE daily email newsletter."
}