{
    "datasource_id": "META, CRWD, or NVDA: Which “Strong Buy” Tech Stock Could Offer the Highest Upside?@TipRanks@2023-06-19 19:42:10.609104@Meta",
    "data": "Several technology stocks have rebounded from last year’s slump and rallied significantly so far in 2023, thanks to the buzz around artificial intelligence (AI) and improved investor sentiment about the times ahead. Using TipRanks’ Stock Comparison Tool, we placed Meta Platforms (NASDAQ:META), CrowdStrike (NASDAQ:CRWD), and Nvidia (NASDAQ:NVDA) against each other to pick the tech stock that could deliver the most attractive upside from current levels.\n\nMeta Platforms (NASDAQ:META)\n\nShares of social media giant Meta Platforms have jumped about 134% since the start of this year. The company’s cost reduction efforts in 2023 (which it calls the “year of efficiency”) and its return to revenue growth in the first quarter after three quarters of decline revived investors’ confidence in the stock.\n\nIn particular, investors appreciated Meta’s Q1 revenue growth, despite the impact of continued macro pressures on the digital advertising market and the lingering effect of Apple’s (NASDAQ:AAPL) iOS privacy policy changes on the company’s ad-targeting capabilities.\n\nMeta is leveraging AI to make ads on its platform more appealing to businesses by making it easier for them to find the right audience. For instance, it is using AI to power automation for advertisers through products like Advantage+ shopping. During the Q1 earnings call, management revealed that daily revenue from Advantage+ shopping campaigns has risen seven times over the last six months. Further, AI has helped boost Reels monetization efficiency by over 30% on Instagram and more than 40% on Facebook quarter-over-quarter.\n\nIs Meta a Good Stock to Buy?\n\nLast week, Piper Sandler analyst Thomas Champion increased his price target for Meta Platforms stock to $310 from $270 and reaffirmed a Buy rating. Champion highlighted that the company has just begun to regain its market share after about two years of declines.\n\nThe analyst believes that Meta’s AI investments, growth in new products like Reels, the crackdown on TikTok, and investments in adtech could drive the stock higher in the second half of this year and into 2024.\n\nWith 37 Buys and five Holds, Meta earns Wall Street’s Strong Buy consensus rating. The average price target of $290.87 implies 3.5% upside.\n\nCrowdStrike (NASDAQ:CRWD)\n\nCybersecurity company CrowdStrike recently reported better-than-anticipated fiscal first-quarter (ended April 30) results, with revenue rising 42% year-over-year to about $693 million. Adjusted EPS jumped 84% to $0.57, driven by higher gross margin and cost discipline.\n\nDespite upbeat Q1 FY24 results and improved full-year outlook, investors were disappointed with the continued slowdown in the company’s top-line growth rate. CrowdStrike expects Q2 FY24 revenue growth in the range of 34% to 36%, reflecting further deceleration amid a tough macro backdrop.\n\nNevertheless, the company is confident about the road ahead based on the growing adoption of its offerings. At the end of Q1 FY24, CrowdStrike’s module adoption rates were 62%, 40%, and 23% for five or more, six or more, and seven or more modules, respectively, as of Q1 end.\n\nCrowdStrike sees more demand for its products driven by the increasing adoption of generative AI. The company has collaborated with Amazon’s (NASDAQ:AMZN) Amazon Web Services (AWS) to develop powerful new generative AI applications that help customers accelerate their cloud, security, and AI ambitions.\n\nIs CrowdStrike a Buy, Sell, or Hold?\n\nMizuho analyst Gregg Moskowitz increased the price target for CrowdStrike stock to $180 from $175 and reiterated a Buy rating following his firm’s annual cybersecurity summit. Moskowitz noted that despite the ongoing macroeconomic pressures, the company stated that demand remains resilient and its pipeline growth is reflecting good momentum. Further, management is confident about emerging as a generative AI winner.\n\nWall Street’s Strong Buy consensus rating on CRWD is based on 30 Buys and two Holds. The average price target of $176.77 implies 14% upside. Shares have risen over 47% since the start of 2023.\n\nNvidia (NASDAQ:NVDA)\n\nChip giant Nvidia’s market-beating fiscal first-quarter results and a stellar Q2 FY24 revenue guidance of $11 billion (plus or minus 2%), which was over 50% higher than the Street’s expectations, triggered a solid rally in the stock. Shares have rallied more than 192% year-to-date.\n\nThe company’s guidance is backed by an impressive demand for its chips in generative AI applications. The demand for Nvidia’s graphics processing units (GPUs) in cloud computing and generative AI applications like OpenAI’s ChatGPT is fueling strong growth in its data center segment, with revenue rising 14% to $4.28 billion in Q1 FY24.\n\nWhile the company’s automotive business contributed only $296 million to Nvidia’s Q1 FY24 top line, its impressive growth trajectory (114% in Q1) cannot be ignored. The company’s automotive design win pipeline over the next six years has climbed to $14 billion from $11 billion a year ago.\n\nWhat is the Target Price for NVDA?\n\nLast week, Morgan Stanley analyst Joseph Moore raised his price target for Nvidia to $500 from $450, while also increasing the price targets for other semiconductor stocks, including Advanced Micro Devices (NASDAQ:AMD).\n\nMoore chose Nvidia as his “top pick” over AMD, as he sees significant upside in the stock over the near team based on his expectation that it could be the “only company” likely to beat and raise this year due to its robust AI exposure. The analyst raised AMD’s price target by $41 to $138, but thinks that “Unlike Nvidia, the company is unlikely to post near term upside.”\n\nMoore expects Nvidia’s data center business to drive much of its growth over the next five years due to demand for the segment’s products, with the spike in interest in generative AI creating a solid environment for AI and machine learning hardware solutions.\n\nNvidia stock, which recently joined the trillion-dollar market-cap club, boasts Wall Street’s Strong Buy consensus rating based on 32 Buys and four Holds. The average price target of $451.48 implies about 6% upside.\n\nConclusion\n\nNvidia and Meta shares have skyrocketed year-to-date and have outperformed CrowdStrike stock. While Wall Street is very bullish about the prospects of all the three tech stocks discussed here, currently, analysts see higher upside in CrowdStrike than the other two stocks.\n\nAs per TipRanks’ Smart Score System, CrowdStrike earns a score of “Perfect 10,” implying the stock is capable of outperforming the broader market over the long term.\n\nDisclosure"
}