{
    "datasource_id": "Addition Of Horizon Worlds In The Metaverse And Its Benefits@The Market Periodical@2023-06-25 11:34:30.693105@Meta",
    "data": "The company invested $36 billion in the development of the Metaverse\nThe Metaverse’s leg modeling is a technical challenge for virtual reality engineers\nStartups in the metaverse have attracted venture capital interest in recent years\nMeta announced the addition of Horizon Worlds to its metaverse in October. The business posted a video of Mark Zuckerberg’s Horizon Worlds avatar joyfully lifting each leg and jumping to demonstrate the new functionality. Previously, $400 VR headset users who explored Meta’s virtual world, observed floating cartoon torso avatars. They would now also have lower bodies, even paws.\nThere are no legs in the metaverse. In the early peeks of the virtual reality (VR) environments created by Facebook’s parent company Meta, we’ve seen cartoonish avatars float above the earth. They just have heads, torsos, and arms. There isn’t even a shadow to be seen where their feet would normally be.\nRelated articles No Content Available\nThe Announcement Was Mocked\nThe optimistic announcement of imminent appendages was mocked. Legs were unable to restore Horizon Worlds’ deteriorating reputation. To become a metaverse firm and create an immersive, accessible virtual reality that coexists with this one permanently, Meta has invested $36 billion. Horizon Worlds, however, was a buggy ghost town. Those who did utilize it were either creeps or kids (even though it’s strictly against the rules). Even Meta’s own workers had little interest in it. Here was one of the world’s most powerful corporations funding the development of its upcoming revolutionary technology project with Bond villain-level resources. And the best it could produce was a shoddy imitation of Second Life that nobody liked.\nIt’s intriguing to consider why having legs isn’t worthwhile, at least from Meta’s point of view. For the time being, Meta is primarily pitching its virtual reality headgear as a tool for office collaboration. It’s crucial to have a face to display to your coworkers and clients if you’re arranging a business meeting in the metaverse. To point out important components of a diagram or make gestures at items on a presentation slide, you need arms. However, beneath a conference table, legs just remain motionless and invisible. They unfortunately have to be amputated because they do not produce any economic benefit.\nThe metaverse’s leg modeling is a technical problem\nFor a virtual reality engineer, legs become a challenging difficulty. The movement of the hands and arms is rather simple to record because both the headset sensors and the handheld controllers can view a person’s shoulders, elbows, and hands. However, it can be challenging to constantly view a person’s hips, knees, and feet from the perspective of a headset camera.\nInstead, a VR gadget would need to rely solely on information from motion sensors attached to a person’s legs or information from an outside camera that can see the user’s entire body. Both options would be expensive. It’s delicate to suppose numerous guests would want to pay a fresh $140 to give their icon legs when they are formerly paying at least $400 just for a headset and hand regulators for Meta’s Quest 2 VR system. Assuming leg detectors bring an analogous quantum, they are not essential for now. Additionally, installing leg sensors or a camera to record entire body movement would add another hassle to the setup process.\nStartups in the metaverse, including Decentraland and the Sandbox, attracted venture capital interest in recent years by marketing themselves as hubs for a brand-new, NFT-driven economy. These businesses have maintained their distinct niches while having high valuations.\nConclusion\nIn a 2021 video, outlining his vision, Mark Zuckerberg called the metaverse “an embodied internet.” His argument is crucial to comprehend a misconception that drives the allegedly $800 billion market. He explains, imitating holding a phone, “When I send my parents a video of my kids, they’ll feel like they’re in the moment with us, not peering through a little window.” “Instead of looking at a screen, you’re going to be in these experiences.” Zuckerberg argues that screens are unable to provide a “deep feeling of presence.”"
}