{
    "datasource_id": "Meta Platforms, Inc. (NASDAQ:META) Receives Consensus Rating of \"Moderate Buy\" from Analysts@MarketBeat@2023-06-25 10:34:30.701118@Meta",
    "data": "Meta Platforms, Inc. (NASDAQ:META - Get Rating) has been assigned an average recommendation of \"Moderate Buy\" from the fifty brokerages that are currently covering the firm, Marketbeat.com reports. Three equities research analysts have rated the stock with a sell rating, seven have given a hold rating, thirty-nine have issued a buy rating and one has issued a strong buy rating on the company. The average 1 year price target among brokers that have issued a report on the stock in the last year is $249.07.\nGet Meta Platforms alerts:\nMETA has been the subject of several recent research reports. Truist Financial boosted their price target on Meta Platforms from $230.00 to $265.00 and gave the stock a \"buy\" rating in a research report on Thursday, April 27th. JPMorgan Chase & Co. boosted their price target on Meta Platforms from $270.00 to $305.00 and gave the stock an \"overweight\" rating in a research report on Thursday, April 27th. Guggenheim boosted their price target on Meta Platforms from $240.00 to $320.00 and gave the stock a \"buy\" rating in a research report on Thursday, April 27th. Piper Sandler upped their target price on Meta Platforms from $270.00 to $310.00 in a research report on Wednesday, June 14th. Finally, Stifel Nicolaus upped their target price on Meta Platforms from $230.00 to $280.00 and gave the company a \"buy\" rating in a research report on Thursday, April 27th.\nMeta Platforms Price Performance\nMETA opened at $288.73 on Friday. The business has a fifty day moving average of $249.66 and a 200 day moving average of $194.01. Meta Platforms has a 52-week low of $88.09 and a 52-week high of $289.67. The company has a quick ratio of 2.07, a current ratio of 2.07 and a debt-to-equity ratio of 0.08. The stock has a market cap of $739.94 billion, a P/E ratio of 35.82, a PEG ratio of 1.07 and a beta of 1.19.\nMeta Platforms (NASDAQ:META - Get Rating) last issued its earnings results on Wednesday, April 26th. The social networking company reported $2.64 earnings per share for the quarter, topping the consensus estimate of $1.96 by $0.68. Meta Platforms had a return on equity of 20.67% and a net margin of 18.27%. The business had revenue of $28.65 billion during the quarter, compared to analysts' expectations of $27.49 billion. As a group, sell-side analysts anticipate that Meta Platforms will post 11.94 EPS for the current year.\nInsider Activity at Meta Platforms\nIn other Meta Platforms news, insider Jennifer Newstead sold 722 shares of Meta Platforms stock in a transaction dated Tuesday, June 20th. The stock was sold at an average price of $278.73, for a total transaction of $201,243.06. Following the completion of the sale, the insider now directly owns 35,200 shares of the company's stock, valued at approximately $9,811,296. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this link. In other news, COO Javier Olivan sold 4,274 shares of the company's stock in a transaction dated Wednesday, May 17th. The stock was sold at an average price of $239.34, for a total transaction of $1,022,939.16. Following the completion of the transaction, the chief operating officer now directly owns 74,983 shares of the company's stock, valued at approximately $17,946,431.22. The transaction was disclosed in a legal filing with the SEC, which is available at this hyperlink. Also, insider Jennifer Newstead sold 722 shares of the company's stock in a transaction dated Tuesday, June 20th. The stock was sold at an average price of $278.73, for a total value of $201,243.06. Following the transaction, the insider now directly owns 35,200 shares of the company's stock, valued at $9,811,296. The disclosure for this sale can be found here. Over the last three months, insiders sold 39,078 shares of company stock worth $9,240,685. Company insiders own 13.75% of the company's stock.\nInstitutional Trading of Meta Platforms\nInstitutional investors and hedge funds have recently made changes to their positions in the company. Worth Asset Management LLC raised its stake in Meta Platforms by 248.6% during the 1st quarter. Worth Asset Management LLC now owns 122 shares of the social networking company's stock valued at $26,000 after acquiring an additional 87 shares during the last quarter. Sageworth Trust Co purchased a new stake in Meta Platforms during the 1st quarter valued at approximately $26,000. HBC Financial Services PLLC raised its stake in Meta Platforms by 2,500.0% during the 1st quarter. HBC Financial Services PLLC now owns 130 shares of the social networking company's stock valued at $28,000 after acquiring an additional 125 shares during the last quarter. Rise Advisors LLC raised its stake in Meta Platforms by 59.3% during the 1st quarter. Rise Advisors LLC now owns 137 shares of the social networking company's stock valued at $29,000 after acquiring an additional 51 shares during the last quarter. Finally, Stephens Consulting LLC raised its stake in Meta Platforms by 44.6% during the 1st quarter. Stephens Consulting LLC now owns 162 shares of the social networking company's stock valued at $34,000 after acquiring an additional 50 shares during the last quarter. 62.54% of the stock is owned by hedge funds and other institutional investors.\nMeta Platforms Company Profile\nMeta Platforms, Inc engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately.\nSee Also\nThis instant news alert was generated by narrative science technology and financial data from MarketBeat in order to provide readers with the fastest and most accurate reporting. This story was reviewed by MarketBeat's editorial team prior to publication. Please send any questions or comments about this story to contact@marketbeat.com.\nBefore you consider Meta Platforms, you'll want to hear this.\nMarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and Meta Platforms wasn't on the list.\nWhile Meta Platforms currently has a \"Moderate Buy\" rating among analysts, top-rated analysts believe these five stocks are better buys.\nView The Five Stocks Here"
}