{
    "datasource_id": "Meta’s Struggles in the AI Race: Researchers Leaving, Layoffs, and Trust Issues@Gizchina.com@2023-06-19 18:42:10.626108@Meta",
    "data": "Mark Zuckerberg, Meta’s CEO, has invested a lot of time and effort in AI. But the company is facing problems as it falls behind rivals. Layoffs and researchers leaving have become real issues for the tech giant.\n\nMeta has been trying to compete in the fast-growing field of AI alongside firms such as OpenAI. But, as it has lost at least one-third of its AI researchers, this became a hard task. Some researchers quit owing to exhaustion, while others raised doubts about Meta.\n\nThe Challenges Faced by Meta in the Field of AI: Loss of Researchers and Trust\n\nYann LeCun, a well-known pioneer in the AI field, ought to oversee Meta’s AI activities in 2013. However, Meta was not invited to the White House’s recent “companies at the forefront of AI innovation” meeting. This is a clear sign of a drop in trust in the firm.\n\nEmployees at Meta are now encouraging the business to reverse its direction and correct prior mistakes that led to a shift away from generative AI. Meta’s AI researchers, led by Yann LeCun, experienced hurdles in creating huge language models and deploying models such as ChatGPT. Despite this, during a meeting with staff in June, Zuckerberg lauded the firm’s AI progress, saying they had reached huge success in generative AI. According to reports, Meta lost numerous scholars last year due to the complaints. Those scholars said they had serious doubts about the company’s AI goals. The November release of ChatGPT by OpenAI intensified the rivalry in AI innovation, causing additional people to leave.\n\nMidjourney, an AI rival, gained fame in just one year as its AI-generated images went viral online.\n\nAccording to an internal study, only 26% of Meta employees showed trust in the company’s leadership. Meta has not yet responded to this topic.\n\nIn his earnings announcement in February, Zuckerberg referred to 2023 as the “year of efficiency.” In November, the company laid off around 11,000 employees, and in the following months, it closed various projects."
}