{
    "datasource_id": "WhatsApp will let you transfer data in a more secure way using “this” feature@The Financial Express@Meta",
    "data": "On Friday, Mark Zuckerberg, the CEO of Meta, unveiled a new function for WhatsApp. The CEO of Meta claims that customers will now be able to easily and securely move their chat history between devices. Currently, the transfer can only occur if both devices are running on the same OS (operating system). The new capability streamlines and speeds up the process of sending messages and larger attachments from one device to another.\nZuckerberg stated in a post shared by him on his official Facebook page, “If you want to move your WhatsApp chats to a new phone, you can now do it more privately without your chats ever leaving your devices.”\nThe new way of transferring chat history via a QR code makes the process more secure, even though WhatsApp already allows its users to move their chat history from one phone to another. At the moment, users have the option of updating the backup on cloud services or using third-party apps to transfer their conversation history.\nWith the new method, users do not have to close their apps on one device in order to transfer data to the other phone. The data is safe because it only travels between two devices without the use of any third-party apps or cloud services.\nAs of now, people usually select an app like Google Drive and use its cloud storage to store the backup of the messaging app. One is given the option to back up the data daily, weekly, monthly, only when one taps “back up,” or never. Further, the user can also choose if they wish to back up their videos or not. One is further given the option of utilising their cellular data to back up.\nTherefore, users won’t need to make a backup of their data in order to transfer their chat history or media files. Both devices must have location enabled and be physically connected to Wi-Fi in order to transfer data via a QR code. To use this feature, the user needs to first go to settings, then chats, then chat transfer, and then Scan the QR code through their new device. In this way, one can transfer chats and media from an old phone efficiently and securely.\nMeta has asserted that this feature is faster than backing up and restoring any chat history. This feature also enables users to now transfer large media files and attachments, which were usually too large to keep."
}