{
    "datasource_id": "From Meta to Google, know how much salary these tech giants paid to their employees@DNA India@2023-06-25 09:34:30.698118@Meta",
    "data": "From Meta to Google, know how much salary these tech giants paid to their employees | Photo: File (Image for representation)\nTwo of the leading 3 highest-paying firms in 2022 are reportedly Facebook's parent corporations Meta and Google's Alphabet, Wall Street Journal reported. It examined information regarding the median salary at 278 S&P 500 businesses gathered by public company researchers MyLogIQ. The workers at these firms reportedly made good wages while going through widespread layoffs.\nHere are the top five highest-paying public firms for the year 2022:\n1. Vici Properties: A commercial property investment trust is called Vici Properties. The company employs 22 people, and the typical wage is $415,000 (more than Rs 3 crore and 40 lakhs). Vici Properties is a New York City-based company. It focuses on developing casinos and operates four golf courses, over 450 eateries, bars, and bars and clubs, as well as racecourses, across the United States.\n2. Meta: Facebook's parent business, Meta, came in second with earnings of almost $296,320 (more than Rs 2 crore and 42 lakh). The remuneration of Mark Zuckerberg, CEO of Meta, was $28 million (Rs 229 crore), which is 91 times the average income for the firm. Social networking sites like, Facebook, Instagram, and WhatsApp are owned by Meta Platforms. Forbes estimates that in 2022–2023, Meta made $117.3 billion in revenue.\n3. Alphabet: In 2022, Alphabet, the parent firm of Google, is ranked third. Its employees have a median income of $279,802 (about Rs 2 crore and 29 lakh). Along with Microsoft, Amazon, Apple, and Meta, it is regarded as one of the Big Five American technological corporations.\nREAD | Business laws: Over 26,000 clauses that can put entrepreneurs in jail for non-compliance\nAccording to the article, Sundar Pichai, the CEO of Alphabet, was paid $226 million (about Rs. 185 lakh crore) in 2022. The median compensation for the firm is around 808 times greater. Google fired 12,000 workers in January 2023.\n4. Etsy: With a typical pay of $248,232 (more than Rs 2 crore and 3 lakh), Etsy comes in at number four. According to Forbes, the company was set up in 2005 by Christopher Maguires, Jared Tarbell, Haim Schoppik, and Robert Kalin and currently employs 1,414 people.\n5. Incyte: Pharmaceuticals giant Incyte ranks sixth on the list with a median pay of $47678 (about Rs 40 lakh). The business specialises in the creation and manufacture of biologic drugs.According to Forbes, Incyte employs about 3,000 employees at the moment."
}