{
    "datasource_id": "Meta's Voicebox AI Mimics Voices of People, Versatile Speech Generator for Audio Editing@Tech Times@2023-06-19 18:42:10.614105@Meta",
    "data": "The latest development from Meta delivers the Voicebox AI which it claims to help generate audio from text or speeches, as well as act as an audio editing tool for all needs. Meta boasts it to be the most \"versatile\" speech generation tool in the industry, allowing people to create or mimic audio with just a click of a button.\n\nIt brings various applications for the internet and tech industry, including that content creation or simply creating home videos that require audio fills or removing unwanted background noises.\n\nMeta Voicebox AI is a Tool for Audio Editing, Speech Generation\n\n(Photo : Meta)\n\nMeta introduced a new tool that centers on speech generation and audio editing, with the Voicebox AI featuring the company's breakthrough in generative AI developments. It claims that this is the most versatile tool for generative speech present in the industry now, with powerful features and functions for multiple needs.\n\nThe Voicebox AI can help in content creation which applies to its social media platforms to help improve its sounds like removing barking dogs or honking cars in the background.\n\nMoreover, this tech can also bring AI-generated voices from text prompts with a click of a button, and give instant outputs, like OpenAI's ChatGPT or DALL-E.\n\nRead Also: Meta Allows Children as Young as 10 to Use Quest VR Headsets but With Condition\n\nMeta's Advanced Voicebox Can Also Mimic People's Voices\n\nThe AI foundation model was also designed to bring the same audio cues from provided sources, meaning that it can mimic people's voices provided that it has samples as short as two seconds long.\n\nMeta also promises that its audio sampling and generations would sound like real people, and not like AI or robotic voices, with a cross-lingual feature that can translate it to six languages including English, French, German, Polish, Portuguese, or Spanish.\n\nMeta's AI Developments and Innovations\n\nMeta is a company that does it all, and this was a track that it fully committed to when it changed its name from Facebook, moving away from its social media roots. It was previously said by Mark Zuckerberg, Meta's CEO, that the company would expand its AI developments which began with new teams forming for social media platforms.\n\nThere were previous iconic releases from the company that helped expand its AI developments to the world.\n\nZuckerberg and Meta previously introduced a large language model which it had developed before, and it allowed access to the public and developers for free. The company calls this the Open Pretrained Transformer (OPT-175B), which leverages 175 billion parameters for its language model that are all available under a noncommercial license for research purposes.\n\nWhile battling AI giants like OpenAI, Midjourney, Adobe, Google, Microsoft, and more, Meta remains committed to debuting its AI developments which present significant advancements to its tech. The Voicebox AI features many possibilities for Meta's social media platform, especially for content creation, with a versatile development featuring speech generation.\n\nRelated Article: Meta CEO Mark Zuckerberg Reveals Plans to Incorporate Generative AI into Every Product\n\nⓒ 2023 TECHTIMES.com All rights reserved. Do not reproduce without permission."
}