{
    "datasource_id": "Facebook, Instagram restrict news access for Canadian users@The News International@2023-06-24 17:34:30.711624@Meta",
    "data": "This representational picture shows the logo of Meta, parent-company of Facebook and Instagram. — AFP/File\nFollowing the controversial online news bill passed by the Canadian parliament, Meta declared it would begin restricting news on its platforms to Canadian users.\nAccording to the legislation, major platforms will be required to pay news publishers for the content that is posted on their websites.\nGoogle and Meta have already experimented with limiting access to the news for some Canadians.\nPreviously, in 2021, a similar law prevented Australian users from sharing or viewing news on Facebook but after discussions with the government resulted in changes, Facebook Australia brought back news content for its users.\nThe Online News Act of Canada, which the Senate approved on Thursday, establishes rules that mandate companies like Meta and Google to enter into business contracts and pay news organisations for their content.\nAccording to Meta, the law is \"fundamentally flawed legislation that ignores the realities of how our platforms work\".\nBefore the bill goes into effect, it was announced on Thursday that news will no longer be available to all Canadian users on Facebook and Instagram, the BBC reported.\n\"A legislative framework that compels us to pay for links or content that we do not post, and which are not the reason the vast majority of people use our platforms, is neither sustainable nor workable,\" a Meta spokesperson said.\nAdditionally, the company said the changes to news would not have an impact on other services for Canadian users while Google criticised the online news bill as \"unworkable\" and is seeking a solution with the government.\nMeanwhile, the federal government believes it is necessary to improve fairness in the Canadian digital news market and ensure fair compensation for news and links shared on platforms.\nAn independent parliament budget watchdog estimated news businesses could receive C$329 million per year from digital platforms.\nIn addition, Canadian Heritage Minister Pablo Rodriguez criticised tech platforms' tests as unacceptable and a threat.\nRodriguez's office plans further discussions with Google and Facebook, but the government will proceed with the bill's implementation, saying, \"If the government can't stand up for Canadians against tech giants, who will?\"\nFurthermore, media industry groups see the act which is expected to take effect in six months in Canada as a step towards market fairness, promoting real journalism and democracy.\n\"Real journalism, created by real journalists, continues to be demanded by Canadians and is vital to our democracy, but it costs real money,\" said Paul Deegan, president and chief executive officer of News Media Canada, a media industry group, said in a statement"
}