{
    "datasource_id": "Why Meta Platforms Stock (NASDAQ:META) Has a Pathway to New Highs@TipRanks@2023-06-19 15:42:10.623107@Meta",
    "data": "Few folks would have predicted that Meta Platforms (NASDAQ:META) stock would recover as quickly as it did in the past several months. Though shares have more than tripled off last year’s low, there are still analysts out there who see more in the way of upside for Meta Platforms stock. Despite being the hottest “FAANG” member of late, Meta stock isn’t exactly trading above and beyond its peers.\n\nIndeed, the going price for a FAANG stock seems to be north of 30 times trailing price-to-earnings these days. With that in mind, Meta stock’s 34.9 times trailing price-to-earnings (P/E) multiple doesn’t seem too stretched, even though it’s considerably higher than its five-year historical average of 24.2.\n\nIn any case, CEO Mark Zuckerberg is a man on a mission, with incredible technological tools he can use to improve the existing social-media business while simultaneously breaking into new markets. Undoubtedly, the market is confident in Zuckerberg’s ability to play offense and defense in this new, high-interest-rate era for tech. I’ve been bullish on Meta stock for over a year now and see no reason to temper my bullishness.\n\nMeta Platforms: Few Firms Can Monetize New Tech Better\n\nMacro-induced ad worries are now a thing of the past. The company’s social-media business continues to be a cash cow, and with new AI innovations factored in, Meta has found a way to adapt in these harsh times, thanks to Zuckerberg’s willingness to experiment with cutting-edge new technologies.\n\nUndoubtedly, Meta has always been a tech-first company, and it’ll likely continue to be as new technologies (think the Metaverse and AI) move into the mainstream. Though Meta’s slow start into the Metaverse has been a concern for some, I continue to believe in Zuckerberg’s unique ability to monetize new innovations.\n\nAny firm can innovate, but it takes a remarkable tech company to innovate and monetize effectively. Though Meta may have been caught in a moral gray area a few years ago with the Cambridge Analytica scandal, I do believe the company is well on its way to improving its reputation.\n\nAs Meta explores monetization possibilities in the Metaverse, I’d not be so shocked if VR and AR-based ads become the next big growth driver at some point over the next decade. With Apple (NASDAQ:AAPL) launching Vision Pro, the moment for the Metaverse may just be a few years away. In any case, Meta is ready, and it will likely be prepared to level up its ad business.\n\nMeta’s Project 92 Could Give Twitter a Run for Its Money\n\nOver the nearer term, Meta has some lower-hanging fruit to pick. The company plans to launch a new social-media network to go up against Twitter. Undoubtedly, a Twitter-like platform (named Project 92) seems to be one of the last missing pieces to make its social business complete.\n\nElon Musk’s Twitter purchase has already lost him a great deal (to the magnitude of billions). As Meta kicks off its competing product, with the network of Facebook and Instagram riding behind it, Musk may be in for a bad case of buyer’s remorse. Only time will tell how Meta’s Twitter rival fares against the actual Twitter. Given the backlash from certain Twitter users following Musk’s acquisition, I do view Meta’s decision to enter the space as opportunistic.\n\nMusk will not back down without a fight. However, as brilliant of an innovator as he is, I’d not bet against Meta’s Twitter rival (Project 92), as some users look to switch to a “sanely-run” alternative.\n\nIs META Stock a Buy, According to Analysts?\n\nTurning to Wall Street, META stock comes in as a Strong Buy. Out of 42 analyst ratings, there are 37 Buys and five Hold recommendations.\n\nThe average Meta stock price target is $289.68, implying upside potential of 3.5%. Analysts’ price targets range from a low of $220.00 per share to a high of $350.00 per share.\n\nThe Bottom Line on Meta Stock\n\nMeta has a lot of exciting products and innovations that could help sustain its current rally, and the Metaverse could be a driver a few years from now.\n\nOver the nearer term, AI innovations and new social platforms like Project 92 could help keep Meta stock’s momentum going strong. Through the ability to quickly monetize hot new tech, Zuckerberg has found a way to prove the doubters wrong in record time!\n\nDisclosure"
}