{
    "datasource_id": "Why Citigroup, Google, Meta and others are tightening return-to-office rules@The National@2023-06-24 17:34:29.945320@Meta",
    "data": "Companies are getting serious about returning to the office despite opposition from workers set on keeping their flexible hours. In one of the latest moves, Citigroup said this week it is requiring stricter office attendance compliance.\nAmid mounting layoffs and signs of a softening economy, a growing number of firms such as Blackrock, Chipotle Mexican Grill, Snap and Walt Disney have felt emboldened to require workers to show up four days a week, testing the limits of the half in-office, half at-home post-pandemic equilibrium.\nUnder the stepped-up return-to-office push, workers will need to decide whether to leave or stick it out. Though overall quit rates are easing in the US, a recent Markets Live Pulse survey found roughly one in two finance professionals said they would switch jobs – or already have – if their managers cut back work-from-home.\nThis year’s return-to-office policies follow 2022 mandates from the likes of Goldman Sachs, Morgan Stanley, Apple and Peloton. Last year Bloomberg required its workers to return to the office a minimum of three days a week.\nSome executives have tried to rebrand the renewed RTO effort, emphasising a continued commitment to flexibility while sounding familiar notes on the value of “creativity”, “collaboration” and “culture.”\nMeanwhile, speculation has arisen among disaffected workers about other reasons executives want workers back in person, such as keeping corporate tax breaks or as a way to quietly trim headcount without announcing layoffs.\nHere is an updated list of major companies ordering workers back to their desks in 2023:\nAmazon's three-day-a-week office policy started in May. That was after chief executive Andy Jassy said in October that managers would be able to decide how often, if at all, their staff should come in.\nThe order came on the heels of a mass layoff of about 18,000 employees and took many by surprise.\nThe company announced a second round of layoffs, cutting another 9,000 workers in March. Staff at the Seattle headquarters staged a walkout, protesting the return-to-office mandate and the firm's climate impact.\n“There is something about being face-to-face with somebody, looking them in the eye and seeing they're fully immersed in whatever you're discussing that bonds people together,” Mr Jassy said on the company's blog.\nAT&T chief executive John Stankey plans to scale back office space by shedding all locations aside from nine core offices. The company enacted a new mandate requiring more than 60,000 managers to work in person at least three days a week, starting in July for the Dallas and Atlanta offices and elsewhere by September.\nMr Stankey insisted that some things have to be done “sitting side by side” and added that the 15 per cent of staffers who do not live near one of the core offices will have to “make decisions that are appropriate to their lives” regarding their future with the company.\nSome employees view it as a move to reduce staff.\nBlackRock is calling employees back to the office at least four days a week starting in September. This change comes nearly two years after the company's unveiling of its “Future of Work” pilot programme in late 2021, which required about half of its staff to work in the office three days a week.\nUAE to issue remote work visas\nChief executive Rob Goldstein and Caroline Heller, global head of human resources, wrote in a staff memo that career development comes from in-person “teaching moments between team members”.\nChipotle Mexican Grill's chief executive Brian Niccol notified corporate staff in May that they will be required on-site four days a week. This shift marks a tightening of the rules laid out by the food chain in March, which instructed workers to head into the office at least three days a week.\nMr Niccol told staff in an email that the company is chasing “aggressive objectives” in a dynamic economy. Under his direction, the company is also undertaking a restructuring.\nCitigroup which has stood out as one of the Wall Street firms most friendly to remote work, announced this week employees will face consequences if they do not meet the firm's three-day in-office requirement.\nCompliance will be considered when rating performance and crafting pay packages, according to a person familiar with the matter.\nThe company is also considering tracking workers' building-entry data in the UK, which it has already been collecting at major offices in the US.\n“We are committed to our hybrid work model and proud of the flexibility it provides our colleagues,” Citigroup said in a statement. “As necessary, we hold colleagues accountable for adhering to their in-office days.”\nGeneral Motors' return-to-office began in January, with employees required to report to offices three days a week. The announcement caused an uproar among corporate employees, catching many off guard.\nExpand Autoplay Working from home comes with challenges for people struggling to balance work and home life. Getty Images\nThe new requirement appeared to walk back the firm's “Work Appropriately” policy, which most took as a vote of confidence in staff to work the hours and in the places that best suit them.\nEmployees at Alphabet's Google are pushing back against the tech company's recent move to mandate that staffers spend at least three days a week in person.\n“Not everyone believes in 'magical hallway conversations,' but there's no question that working together in the same room makes a positive difference,” Google's chief people officer Fiona Cicconi wrote in an email to employees. She added that attendance will now be a factor in performance reviews.\nThis decision comes after Alphabet, Google's parent company, carried out the largest job cuts in its history, reducing its workforce by more than 6 per cent, or about 12,000 employees in January.\nJP Morgan Chase told its managing directors that they are now required to show up in person every weekday, scrapping the hybrid arrangement adopted during the pandemic for its top staff.\nThe bank's operating committee expressed that high-ranking executives should “lead by example” in an internal memo that elaborates that leaders must be “visible on the floor” for client meetings and accessibility.\nEarlier this year, chief executive Jamie Dimon said that working remotely “doesn't work” for younger staff or bosses.\nMeta chief executive Mark Zuckerberg announced plans to let go another 10,000 workers and close 5,000 open roles this spring in another round of deep cuts following the company's first large-scale layoff of 11,000 employees last year.\nWhile Meta was one of the first tech companies to offer all of its employees the ability to work from home, Mr Zuckerberg is now asking staff to come in three days a week starting in September, though employees previously designated remote will be allowed to remain off site.\nNews Corp, the publisher of The Wall Street Journal and other newspapers, has issued a memo to its workforce encouraging them to return to the office for the “subtleties of body language and the nuances of knowing glances”, for which working from home does not allow.\nThough chief executive Robert Thomson conveyed his desire for staff to come in more than they are now, the company has remained vague about exactly how many days employees are expected to show up.\n“There is some room for flexibility in the work environment, but that flexibility is not boundless,” Mr Thomson said in the memo.\n“Attendance is an absolute imperative as collaboration and co-operation are priorities for each of our businesses.”\nWalmart will close tech offices in Austin, Texas, Portland, Oregon, and Carlsbad, California, requiring affected employees to relocate to the company's other offices, including one in San Bruno, California, or its headquarters in Bentonville, Arkansas, where they will need to report to the office at least twice a week.\nThose who choose to leave the company as a result of the closures will receive severance pay, according to an internal memo."
}