{
    "datasource_id": "Meta Cuts Another 10000 Employees After Eliminating NFT Plans—Is The Metaverse Still On – Decrypt@CryptoSaurus@Meta",
    "data": "Meta Cuts Another 10,000 Employees After Eliminating NFT Plans—Is The Metaverse Still On?\n$30,519.00\n$1,913.47\n$245.26\n$0.483634\n$0.289686\n$0.067148\n$110.86\n$19.22\n$0.075519\n$5.27\n$0.668702\n$273.08\n$30,506.00\n$12.85\n$0.00000753\n$5.49\n$4.17\n$6.44\n$163.60\n$20.24\n$0.104816\n$9.44\n$44.44\n$2.11\n$4.14\n$4.06\n$7.40\n$0.056744\n$0.02036425\n$1.47\n$67.85\n$47.84\n$0.124271\n$0.306379\n$0.752562\n$0.443239\n$2.23\n$0.81442\n$0.752873\n$2.02\n$0.403089\n$2.30\n$6.30\n$803.36\n$9.56\n$0.766602\n$0.00000153\n$6.64\n$0.99849\n$37.33\n$0.077854\n$5.61\n$53.02\n$0.02135365\n$1.59\n$1.066\n$0.307639\n$0.323556\n$0.202469\n$33.20\n$34.06\n$0.02939095\n$0.050898\n$0.484375\n$2.08\n$0.642273\n$10.54\n$0.181575\n$0.213709\n$0.00865853\n$0.0485495\n$0.01266661\n$0.669502\n$0.334189\n$0.825948\n$8.43\n$0.00713567\n$0.555809\n$0.651745\n$1.26\n$0.181516\n$0.181046\n$0.00171453\n$0.321802\n$0.084684\n$0.077874\n$0.00196993\n$0.139567\n$0.051281\n$3.62\n$0.00000036\n$0.00000666\n$0.00727937\n$0.703088\n$0.0003948\n$1.63\n$0.00008316\n$0.04444546\nMeta’s workforce has grown in recent years as Facebook’s parent company signaled its ambitions for the metaverse — but recent moves suggest it’s feeling the sting of changing tech trends and poor market conditions. The company announced another round of layoffs today, a day after saying it was “discontinuing” support for NFTs.\nCo-founder and CEO Mark Zuckerberg wrote in a post today that Meta will lay off about 10,000 additional employees in several phases over the coming months, as well as close about 5,000 existing listings for open positions. The move will affect its recruiting department this week, its technical group in April and the business group in May.\nAccording to CNBC, Meta previously laid off about 11,000 employees in November, which was about 13% of its workforce at the time. As of December 31, 2022, Meta reported a headcount of 86,482 people across all divisions — a 20% increase from the previous year — but said this number still included most of the November layoffs.\nZuckerberg framed the latest cuts as part of Meta’s broader “year of efficiency” campaign, which sees the social media giant flattening its organizational structure, “canceling low-priority projects” and optimizing tools. Hui attempts to move forward with a thin team. processes across the company.\nSo what does this mean for the Metaverse then? Meta made a lot of noise in 2021 over the idea of ​​a 3D Internet of the future, changing its company name to reflect what Zuckerberg described as a new frontier for the dominant tech company. This news helped increase interest in the Web3 Metaverse games, as well as increasing the value of Virtual Land NFT plots.\nBut the Metaverse discussion has cooled amid the idea of ​​a wider Internet in 2022, an early version of Meta, and the rising cost of digital real estate.\nMeta shifted its focus to building the Metaverse late last year, but thanks to the success of rival OpenAI’s ChatGPT, it has turned its message to the new enthusiasm around artificial intelligence (AI). Indeed, Zuckerberg’s post today mentions AI beyond the metaverse among the technologies focused on by Meta.\n“One of our biggest investments is in advancing AI and incorporating it into every product we make,” he wrote. “Our pioneering work building the metaverse and shaping the next generation of computing platforms also remains central to defining the future of social connection.”\nIn Meta’s Q4 2022 earnings call on February 1, Zuckerberg said that “the key tech waves driving our roadmap are AI today and the metaverse in the long term,” adding that the firm’s “priorities haven’t changed from last year.”\nHe then emphasized that Meta continues to invest in virtual reality and mixed reality headsets through its Reality Labs division to build the immersive internet of the future. However, Zuckerberg said that “most people are going to experience the metaverse on a phone for the first time and will start building their digital identities on our apps.”\nYesterday, Meta announced that it is “discontinuing” support for NFTs on its platform, less than a year after entering the space. Instagram first launched an NFT test in May 2022, allowing select users of the photo-sharing app to display their owned artwork and collectibles. Later Facebook also added the same feature.\nIn November, Instagram said it would let creators build their own NFTs through Polygon, an Ethereum scaling network, and then launched exclusive NFT mints from notable creators like photographer Isaac “Drift” Wright and AI artist Refik Anadol. .\nSome product news: Across the company, we’re taking a close look at what we prioritize to increase our focus. We are shutting down Digital Collectibles (NFTs) for the time being to focus on other ways to support creators, people and businesses.[1/5]\n— Stephen Kasriel (@skasriel) March 13, 2023\nIn a twitter threadMeta’s commerce and fintech lead Stephen Kasriel said the company will move away from NFT collectibles to “focus on other ways to support creators, people and businesses on our apps both today and in the metaverse.”\nIt was always unclear how much role NFTs and Web3 would play in the meta version of the metaverse. The NFTs were being sold after a digital concert in Meta’s Metaverse performance video in 2021, and Zuckerberg made a point to emphasize the benefits of interoperability, but the firm has yet to detail the limits of Web 3 technology in its plans. is not given.\nWeb3 Metaverse builders see NFTs as key to their vision of an open metaverse in which users can bring their own avatars, apparel and items to the online platform. But while tech giants such as Meta and Microsoft have announced plans for the Metaverse, they have shown interest in interoperable standards – but not explicitly adopted blockchain networks and assets.\nMeta declined further comment to Decrypt regarding the impact of the layoffs on its Metaverse push, as well as how its NFT announcement ties in.\nBased on today’s announcement and other recent comments, Meta still says it is moving towards the Metaverse. Meta has consistently framed this as a long-term process, but that message is being amplified especially as AI development takes more priority in the tech world — and NFTs won’t be a significant factor in that push, at least. less for now.\nYour Gateway to the World of Web3\nThe latest news, articles and resources, delivered weekly to your inbox.\n© A media company for the Web 3.0 era. 2023 Decrypt Media, Inc.\nSource\nSource"
}