{
    "datasource_id": "Two Largest Social Media Platforms Are Ending Service@Giant Freakin Robot@2023-06-24 17:25:07.568223@Meta",
    "data": "Meta is removing news from Facebook and Instagram in Canada to avoid paying content creators.\nBy Douglas Helm |\nMeta is not too happy with Canada right now. In the wake of Canada passing the Online News Act, aka C-18, Meta is cutting off Canadian users’ access to news on Facebook and Instagram. In other words, Canadians will have to get their news from somewhere other than social media.\nThe Online News Act says that sites like Facebook and Instagram will have to pay news publishers if they reproduce the news outlets’ content. Meta has not been a fan of this bill from the start and has opposed its passing, threatening to cut off news access to Canadians on its platforms. It looks like the company will now follow through.\nIn short, Facebook and Instagram’s parent company doesn’t want to have to pay more money to news outlets, and Canadians will be mildly inconvenienced by going straight to the source to get their news. Companies like Meta have been frequently accused of bias with the news that gets pushed on its platforms, so it’s possible that this won’t hurt Canada as much as Meta seems to think it will.\nMeta went ahead and posted a blog about following through on the threat, and the company added that the blackout wouldn’t be affecting the other features on the platform.\nWhile it’s true that plenty of people get their news from social media sites like Facebook, there’s also plenty of debate as to whether this is actually a good thing. Canada passing this bill could very well lead to similar legislation from other countries in the future, but that remains to be seen. It’ll be interesting to see how much the Canadian population actually cares about having their social media news access cut off.\nIn the end, the bill was primarily passed to benefit local journalism and independent news outlets, which people agreed with since the bill was passed. Facebook, or rather Meta, feels like this payment arrangement is “unworkable,” so it seems like the company will lash out in this way to try and get the decision reversed. That might work out for them because Meta pulled a similar stunt in the past.\nWhen Australia tried to pass journalism laws that Meta didn’t care about a couple of years ago, the company responded by cutting off news access to Facebook and Instagram to around 17 million users. Meta would bring the services back online after the Australian government agreed to tone down the bill to the benefit of Meta and Google. However, it seems Canada will try to stand its ground as Canadian Prime Minister Justin Trudeau accused the tech giant of “bullying tactics.”\nThe US is also in talks to put similar bills in place, and Meta even threatened to cut off news access on Facebook and Instagram in California. It’ll be interesting to see how these bills pan out and if Canada will be able to stand its ground against these massive tech companies. Stay tuned, and we’ll keep you updated on this and other important tech stories."
}