{
    "datasource_id": "Elon Musk, Mark Zuckerberg's fight started before Meta's Twitter rival@The Washington Post@2023-06-24 17:34:29.940808@Meta",
    "data": "The Elonization of Mark Zuckerberg: How the Meta CEO is playing it cool Meta chief executive Mark Zuckerberg has been trying to appear more relevant among the tech elite (Washington Post illustration; Photos by The Washington Post; iStock)\nListen 7 min Share this article Share Comment on this story Comment\nMark Zuckerberg has been trying to make himself cool again — and more relevant to a tech elite taken with the online antagonism and offline antics of Elon Musk. Over the past year, Zuckerberg has appeared on podcasts hosted by provocateur Joe Rogan and AI researcher Lex Fridman, both popular among fans of Twitter owner Musk. He has posted sweaty action shots on Instagram displaying his jujitsu skills. And this week, he accepted Musk’s challenge to a cage fight after news reports on Meta creating a Twitter competitor. The pair have agreed to fight at the “Vegas Octagon,” an Ultimate Fighting Championship arena, although it’s unclear if and when it will take place.\nThe strategy to pitch Zuckerberg as visionary innovator to a tech-savvy audience losing its enthusiasm for his social media empire has been years in the making, according to people familiar with the matter who spoke on the condition of anonymity to discuss sensitive internal matters. But Zuckerberg has really ramped it up over the past year, one of the people said, courting the same “tech bros” who have been captivated by Musk — who is suddenly Zuckerberg’s competition in more ways than one.\nAs Meta struggles with layoffs and its so far unrealized dreams of the metaverse, “I think Mark is also getting a feeling that he is not respected,” said Bhaskar Chakravorti, dean of global business at Tufts University’s Fletcher School. The cage match was “a way for him to show that, ‘Look, he is edgy. He can be a tech bro just like the next guy.’”\nAdvertisement\nI’m up for a cage match if he is lol — Elon Musk (@elonmusk) June 21, 2023\nAdvertisement\nMeta has long understood that Zuckerberg is more synonymous with his product than other Big Tech company leaders and even conducted polling on the CEO’s likability and whether Facebook’s best days were behind it, said one of the people familiar with the company’s communications strategy. Zuckerberg, in particular, is sensitive to being perceived as an innovator and interested in what the public thinks.\nMeta’s communications relations team has been positioning him as the company’s chief storyteller in recent years, announcing many of the company’s products directly, the people said. That has also meant putting him in front of journalists and influencers they perceive as influential with early adopters and the tech workforce. This shift also coincided with the company’s plans to rename itself Meta and Zuckerberg’s decision to elevate Global Affairs President Nick Clegg to be the company’s main content moderation defender.\nAdvertisement\nIn recent weeks, Zuckerberg has also sought to win back the support of his workers, following tens of thousands of layoffs. The CEO has defended his leadership internally, arguing that he should be judged on whether the company is making progress toward its business goals. And he has spent more time lately talking about the company’s new product investments in artificial intelligence with the goal that they might become more excited about where the company is headed.\nZuckerberg has turned to Instagram to try to promote that edgier image. Three weeks ago, he posted a selfie sporting a camouflaged vest, announcing that he had just completed the “Murph challenge,” a popular exercise challenge that requires a heavy dose of running, pull-ups, push-ups and squats while wearing a 20-pound weighted pack.\nJujitsu, within the last couple of years, has also taken top billing. After it was reported that Zuckerberg was choked unconscious during one of his matches, the CEO contacted the New York Times to deny that it happened, according to the newspaper.\nIn 2021, he posted a video of himself hover-boarding with an American flag on July 4.\n“These founders … are wanting to drive their story directly,” said Brooke Hammerling, a public relations consultant for technology companies. “The CEO story can become bigger than the company itself.”\nWhile Zuckerberg and Musk share many traits as tech CEOs, their public images have diverged from each other in recent years.\nZuckerberg’s image has suffered setbacks after a long stretch of scandals and policy fights over Facebook’s content moderation practices. More recently, Meta has faced major problems at its business that have kneecapped the company’s growth. Its core blue app is losing its appeal among younger audiences who favor newer apps Snapchat and TikTok. Sluggish post-pandemic growth in e-commerce has cut into the company’s advertising business. An Apple change in privacy settings was estimated to have cost the company billions.\nMeanwhile, Zuckerberg’s big bet on virtual and augmented reality appears years away from making money, and Meta has been slow to build products in generative artificial intelligence, which has already transformed the technology industry.\nMusk, on the other hand, is the richest man in the world, thanks in large part to his stake in Tesla, where he is the CEO. His rocket ship company, SpaceX, has won major government contracts, and his decision to buy Twitter last year and pledge to the right to free speech on the social media platform won accolades from different corners of the tech sector.\nMusk’s penchant for tweeting at odd hours and trolling his critics — as well as his crusade against “cancel culture” and the “woke mind virus” — attracted political conservatives and leaders from within Silicon Valley’s reactionary right. More of the contrarian tech crowd followed when Musk slashed Twitter’s workforce, demanded a return to office and promised to build a “based” alternative to “woke” AI, borrowing a compliment from extremely online factions of Twitter.\nThe two billionaires have long sparred in public. In 2016, Zuckerberg criticized Musk after a SpaceX rocket exploded and destroyed one of Facebook’s satellites that was part of a project to expand internet connectivity around the world. A year later, the two traded barbs over their differing perspectives on the risks of artificial intelligence. In recent years, Musk has also advocated for deleting Facebook and criticized the platform’s role in facilitating the riots at the U.S. Capitol on Jan. 6.\nNow, the two CEOs are gearing up for another battle. Meta is exploring building a decentralized social media network as an alternative to Twitter, the news that prompted the challenge to battle from Musk.\nHappy July 4th! 🇺🇸 Posted by Mark Zuckerberg on Sunday, July 4, 2021\n“I think there is another aspect to the viral cage match between the two, which is now many more people are aware of the fact that Facebook wants to start a Twitter alternative. And they are going to want to check it out when it’s announced,” Chakravorti said. “So this is free advertising.”\nAdvertisement\nZuckerberg’s commitment to the rivalry may continue to be tested.\nAfter Zuckerberg won two medals at his first jujitsu tournament in May, he went on Fridman’s podcast to discuss his interest in the sport and vision for Meta. The two men geeked out on jujitsu, trading opinions on why it’s such a difficult sport and what they have learned about life from participating.\nFridman also pressed Zuckerberg to say something he thinks Musk has done right at Twitter. Zuckerberg said Musk’s decision to make drastic cuts and changes to the company’s workforce emboldened other tech leaders — including himself — who might have been hesitant before to follow suit.\n“It was probably good for the industry that he made those changes,” Zuckerberg said."
}