{
    "datasource_id": "EU's AI regulations receive support of Google and Meta@Business Upturn@2023-06-24 17:34:29.935806@Meta",
    "data": "Advertisement\nFollowing conversations with European Commission Thierry Breton, technology industry executives Mark Zuckerberg and Sam Altman expressed support for governmental regulation of artificial intelligence.\nThe commissioner claimed on Friday that he and Zuckerberg, CEO of Meta Platforms, were “aligned” about the EU’s artificial intelligence policy, which is currently the subject of final negotiations. They concurred with measures like watermarking and the bloc’s risk-based strategy, according to Breton\n“I really appreciate the European institution here, and the foresight on taking this issue so seriously, for the rest of the world, too.”, said Altman, the CEO of OpenAI\nAdvertisement\n“We look forward to working with you to be running well in advance and offering a European service in compliance with the European market,” Altman added.\nNick Clegg is Meta’s President of global affairs. He said that his company “shared our support for the objectives of the AI Pact. While we need to study the details, we recognize it’s important for tech companies to be open about the work they’re doing on AI & engage collaboratively across the industry, governments & civil society.”\nBreton visited many IT firms this week as part of his trip, which included the conversations on Friday. The owner of Facebook and Instagram, according to Breton, appears well-prepared to comply with Europe’s new stringent content moderation regulations after his visit to Meta, but will submit to a stress test of its systems next month.\nAdvertisement\nIn the middle of July, Zuckerberg consented to a trial to evaluate how the firm applies content control guidelines. According to Breton, Meta has about 1,000 employees working on DSA implementation. This meeting, thus, presents a lot of hope regarding the future of digital content regulations."
}