{
    "datasource_id": "Alphabet and Meta among top-paying big companies in 2022: WSJ@Business Insider@2023-06-19 18:42:10.626108@Meta",
    "data": "Tech giants Alphabet and Meta were among the top-paying public companies in 2022.\n\nThey've laid off around 33,000 workers since 2022 — but offer some of the highest median salaries.\n\nA real-estate company offered the highest median salary to its 22 employees.\n\nMorning Brew Insider recommends waking up with, a daily newsletter. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking “Sign Up,” you also agree to marketing emails from both Insider and Morning Brew; and you accept Insider’s Terms and Privacy Policy Click here for Morning Brew’s privacy policy.\n\nAlphabet, the parent company of Google, and Meta were among the top-paying public companies in 2022, according to an analysis by the Wall Street Journal.\n\nThe Journal analyzed data compiled by public-company analysts MyLogIQ about the median salaries at 278 companies in the S&P 500.\n\nMeta placed second, offering employees a median salary of nearly $300,000, with Alphabet at number three with a median wage of $280,000.\n\nBut Vici Properties, a real-estate-investment trust with just 22 employees, came top with a median salary of around $415,000. The company owns a host of casinos across the US, but it didn't include salary data for the hourly workers employed by its portfolio properties.\n\nIn a year marred by tech layoffs and a pullback on employee perks, Alphabet and Meta have cut around 33,000 staffers since 2022. Google's median pay package slipped from the top spot in 2021, according to the Journal's analysis.\n\nThe Journal reported that, overall, median salary ranges in 2022 didn't fall \"significantly\" from 2021, when public companies enjoyed large gains in the public markets.\n\nThe Journal calculated how much more CEOs earned than the company average by dividing the CEO's annual compensation, found in SEC filings, by the median pay.\n\nAmong the S&P 500 executives, Alphabet CEO Sundar Pichai took home the highest salary package of $226 million — 808 times more than the company's median pay. Meta chief Mark Zuckerberg took home $28 million in compensation, 91 times more than its median pay. Vici Properties' CEO Edward Pitoniak had a pay ratio of 28 — down from 273 in 2021.\n\nWhile the data analyzed compensation from median workers, the Journal noted that, while companies have to disclose the total compensation offered to median employees globally, \"they have some latitude in how they identify their median worker.\""
}