{
    "datasource_id": "Malaysia to take legal actions against Meta for failure to remove 'undesirable' posts@Jurist.org@2023-06-24 17:34:29.930301@Meta",
    "data": "The Malaysian government announced on Friday that it would take legal action against Facebook parent company Meta for its failure to remove “harmful” content relating to race and religion.\nThe Malaysian Communications and Multimedia Commission (MCMC), the public body regulating communications and multimedia in Malaysia, published an official statement on its website with resentments. It mentioned that “despite repeated requests from MCMC, Meta has failed to take sufficient action to address the issue of undesirable content on its platform.” MCMC said responses had been received from Facebook’s parent company, yet the Malaysian administration does not accept the “sluggish and unsatisfactory” reactions.\nAt the end of the statement, MCMC reinforced that legal actions are necessary to promote accountability for cybersecurity and protect consumers. Yet, according to the source, MCMC has not been commenting on what legal actions might be taken.\nThe current Prime Minister, Anwar Ibrahim, promised to deal with provocative posts on Facebook and other social media platforms, such as Tiktok and Telegram. Communications and Digital Minister Fahmi Fadzil raised the need to meet with Meta to curb any Facebook activities touching on race and religion.\nFazil also raised the necessity to look into possible amendments to the Communications and Multimedia Act to make MCMC more authoritative over related issues. The Act was last amended in 1993, and non-compliance with MCMC’s direction could be liable for imprisonment of up to 3 years. MCMC also has the power to initiate an inquiry about communications and multimedia issues whenever it finds necessary.\nThe Southeast Asian nation comprises Muslim ethnic Malays as the majority, with ethnic Chinese and Indian minorities, race and religion have been a hot potato in Malaysian politics. The ethnic tension in Malaysia intensified significantly since last year in November before Ibrahim won the election and came to power."
}