{
    "datasource_id": "Amid major tech layoffs by Dell, Google, Meta, WARN Act does little to show Austin impact@Austin American-Statesman@2023-06-19 14:42:09.714917@Meta",
    "data": "Many of Austin's best-known employers in the technology sector have slashed hundreds of jobs in recent years, including Facebook parent company Meta, Round Rock-based Dell, Austin-based Tesla, Austin-based Indeed and Google's parent company Alphabet.\n\nBut despite federal regulations requiring that certain layoffs and workplace closures be publicly reported, the full scope of lost jobs remains unclear because only a handful of companies have reported local layoff numbers, and many companies have declined to disclose numbers by office location.\n\nMany layoffs don't even meet the criteria for self-reporting due to the narrow and complex regulations that govern whether, and when, employers have to disclose mass layoffs.\n\nAnd a relatively toothless enforcement policy for violators of the federal policy, known as the Worker Adjustment and Retraining Notification Act (or WARN Act for short), might lead others to simply ignore the reporting regulations in an effort to avoid bad publicity.\n\nSo what is the WARN Act? How does it apply to Texas? What obligations do companies have to their employees and their local governments? And how many layoffs have been reported in Austin this year?\n\nMore:Austin-based Oracle cuts employees including in its Cerner healthcare unit, report says\n\nThe American-Statesman talked to several experts in an effort to answer these questions and others, as well as attempt to more clearly understand the employment picture in Central Texas. Here's what we learned:\n\nWhat is the WARN Act?\n\nThe WARN Act is the federal law mandating that employers provide notice to state governments in the event of major layoffs.\n\nThe law went into effect in 1989 after passing with bipartisan support in Congress but without President Ronald Reagan's signature.\n\nIt followed years of efforts to pass a law that would require businesses to give notice of plant closures and mass layoffs, after several closures of large steel mills that led to stress in their communities.\n\nSome states, not including Texas, have their own versions of the WARN Act, with stricter rules, and some critics have argued that the federal statute does not do enough to protect workers. Proposed legislation introduced as recently as 2022 called for workers to have more warning and for more companies to be included.\n\nIn Texas, all WARN notices are publicly available, and the numbers are posted to the Texas Workforce Commission website. But under the complex statute, employers aren't required to report every instance of slashed jobs.\n\nTech companies are cutting jobs.How it's impacting Austin\n\nWhen does the WARN Act apply?\n\nTed Smith, a labor and employment attorney with the Cornell Smith Mierl Brutocao Burton law firm, said the WARN Act largely refers to two different things: a plant or workplace facility closure or a mass layoff. The statute refers only to employers with at least 100 employees.\n\nUnder WARN, a facility closure is a workplace or plant completely shutting down. To be considered a mass layoff, an employer has to cut at least 50 jobs, and the number of cuts should be at least a third of the workforce. Companies cutting more than 500 employees also must file, regardless of the percentage.\n\nSmith said a number of Austin companies that have made cuts in recent years might fall outside of the requirements.\n\n“If they’re a small company they're not covered at all, or it can be a really large company, where even if they're laying off 100 employees, if their facility is 1,000 employees, they're not hitting that one-third threshold,” Smith said.\n\nMike Golden, a University of Texas School of Law advocacy director and lecturer who specializes in employment law, said once there is a mass layoff, employers have two sets of obligations: Tell the unit of local government, and give employees notice of the layoffs.\n\nThe unit of local government is generally considered to be the county, and in Texas it is generally the county commissioners court. Under the act, employers also must give affected employees a 60-day notice, 60 days of pay or a combination of the two, Golden said.\n\nThe employee count applies only to full-time employees, and it excludes those who work fewer than 20 hours a week, as well as most recent hires and seasonal hires, Golden said.\n\nTiming also determines whether an employer needs to report a layoff. Golden said any layoffs that happen at the same company site within a 30-day window will always be counted together toward the 50-person minimum.\n\nAny losses within a 90-day window would also be counted together unless an employer can show they have \"separate and distinct\" causes.\n\nMore:Intel slashes jobs nationally, to sell Austin office amid wider tech industry uncertainty\n\nWARN Act comes with lots of rules and exceptions\n\nBoth lawyers said the statute comes with complicated definitions and exceptions.\n\n“It's a pretty complicated statute, and it's very technical ... even things that might look clear,\" Smith said. \"There’s lots of different exceptions and variations that can cause the WARN Act to not apply.\"\n\nA common issue that waives the required 60-day notice rule is the unforeseeable business exception, which is used for events that are not considered to be reasonable to see coming, such as a company losing its biggest contractor. Smith said companies often tried to use that exception in the early days of the pandemic.\n\nGolden said another issue that waives the notice period is the \"faltering company exception,\" in which a company is going out of business and was seeking capital or business that would have prevented the shutdown.\n\n\"If you use one of the exceptions, it's your job to establish the evidence that shows the exception. And you still have to give as much notice as practicable,\" Golden said.\n\nIs it common to simply not report layoffs?\n\nGolden said it's also not uncommon for employers not to report layoffs even if required to by the WARN Act.\n\n\"A significant number of employers do not give notice to the local government because there is effectively no enforcement mechanism,\" Golden said. \"There is a $500 a day (per employee) penalty for failing to give notice to the local government, but the penalty is waived if all affected employees got the required notice.\"\n\nGolden said in his experience in employment law most of the time employers laying off large groups of people are trying to minimize any news that can come of it, adding to the lack of incentive to report.\n\nMore:Tech firm Accenture slashing 549 jobs at Domain offices in Austin\n\nHow often is the WARN Act violated?\n\nSmith said in his experience it's relatively rare for larger companies not to comply with WARN, and many of these companies offer severance payments for affected employees that typically cover the 60 days of notice. However, he said because the WARN Act is a very technical law, many midsize companies with less sophisticated human resources or legal teams might unwittingly be in violation.\n\n\"Many times, the decision to downsize through layoffs at these smaller companies needs to be made relatively quickly, and they may not have the time or legal resources to research and work through the potential WARN Act issues and requirements,\" Smith said.\n\nEnforcement is not common if a violation does occur, since mass layoffs typically happen when a company is going out of business or filing for bankruptcy, and therefore attorneys might not think filing a case is worth it, Smith added.\n\nIn the Western District of Texas — which covers a wide-reaching area with courts in Alpine, Austin, Del Rio, El Paso, San Antonio, Waco, Midland, Pecos and San Antonio — just one case related to a WARN violation is currently open. In total, only 20 such cases have been filed in the past decade, primarily between 2013 and 2015, and just three have been filed since 2021.\n\nWhat layoffs do we know of?\n\nAccording to WARN notices alone, Texas has seen tens of thousands of layoffs in the past several years. This year, 2,500 jobs have been slashed in Central Texas alone, a significant jump from 2022 and 2021.\n\nIn all of Texas, 11,637 layoffs have been reported in 2023. Of those, 2,585 cuts have been reported by 13 employers in Central Texas, including six Austin-area employers that each cut more than 100 workers.\n\nFor comparison, in 2022 Texas saw 7,303 jobs cut. Central Texas had 472 jobs cut by five employers, including Meta, which laid off 222; Argo AI, which shut down its Austin operations, cutting 78 people; and software startup Rev.com, which cut 85 employees. In 2021, Texas saw 13,413 jobs cut, including 458 in Central Texas. Seven Central Texas employers, including hotels and medical and tech companies, each cut fewer than 150 people.\n\nMore than half of the Austin area's 2023's cuts have come from two employers: Accenture, which announced in May that it would cut 549 people in June, and transportation giant Ryder, which cut 801 people in March. Both are among the largest layoffs reported to WARN in recent years by a Central Texas employer.\n\nEven with a lack of concrete numbers, industry experts have maintained that Austin has seen impacts from the layoff waves in the technology industry. Big-name companies with a significant Austin presence including Intel, Dell, Tesla, Google and Indeed have also nationally cut workers in recent years amid waves of layoffs in the tech industry but have not shown up on notices.\n\nDan Ives, an analyst with Wedbush Securities, estimated that Austin has seen roughly 10% of the total tech layoffs by Meta and other big technology companies.\n\nMeta, the parent company of Facebook and Instagram, which has 1,200 Austin employees, filed Texas WARN notices in November 2022 when it cut more than 200 people. Globally, the company has cut more than 20,000 jobs, about a quarter of its workforce, since November over multiple rounds. But as Meta layoff rounds have continued, no further WARN notices have surfaced in Texas.\n\nIves said certain sectors, including digital advertising, e-commerce and software, have probably taken big hits, but nationally layoffs are starting to slow down.\n\n“We believe in tech most of the layoffs are in the rearview mirror,” Ives said."
}