{
    "datasource_id": "My Meta shares are up 114%. Should I take profits or buy more?@Yahoo Finance@2023-06-19 14:42:09.714917@Meta",
    "data": "My Meta shares are up 114%. Should I take profits or buy more?\n\nImage source: Getty Images\n\nSocial media and digital advertising have exploded in recent years. As more users develop content, brands are competing for our attention. There are a number of companies in the space innovating at a rapid pace, most notably Meta Platforms (NASDAQ:META). I’ve held Meta shares for several years. But with a recent rally doubling the share price, should I take my profits, or buy more?\n\nMeta is a social media company that owns and operates a number of popular platforms. These include Facebook, Instagram, WhatsApp, and Messenger. The company also develops and sells virtual reality (VR) and augmented reality (AR) headsets.\n\nMarkets punished Meta in 2022, as investors felt that experiments with the metaverse and virtual reality technology were a distraction from the main revenue source, advertising. In 2023, we have seen a different story. As CEO Mark Zuckerberg announced a pivot to focus on ‘efficiency’, and excitement around the potential of AI grew, the share price has soared 114%.\n\nIs there more growth ahead?\n\nAnalysts expect Meta’s revenue to grow by 17% in 2023. They also expect earnings per share to grow by 9%. These estimates are roughly in line with the sector average, but demonstrate strong growth prospects for a mature company.\n\nWhy would I invest more?\n\nThere are a number of reasons why investors might want to consider investing in Meta. These include:\n\nStrong growth prospects: Meta is a leader in the social media space, which is expected to continue to grow in the coming years.\n\nProfitable: The company is profitable and generates significant cash flow, which can be used to invest in growth initiatives or return to shareholders. Debt levels are also sustainable, and reducing.\n\nUndervalued : Despite the meteoric rise, Meta shares may still be undervalued. The price-to-earnings (P/E) ratio of 32 times is slightly below the average of the sector at 34 times, and discounted cash flow calculations suggest the shares may be 20% undervalued.\n\nStrong management team: Meta is led by a talented, founder-led management team with a proven track record of success.\n\nWhy would I sell?\n\nThere are a few potential issues that investors should be aware of. These include:\n\nHigh valuation: Despite being undervalued according to the calculations above, Meta is a high-growth company with a high valuation. If investor sentiment changes, or if the wider economy suffers a downturn, companies that have seen rapid rises and may appear expensive will likely suffer.\n\nCompetition: Meta faces competition from other social media companies, such as Twitter and Snapchat. Apple has also recently announced an augmented reality device. These companies are growing rapidly and could take market share away from Meta.\n\nRegulatory risk: Meta is facing increased scrutiny from regulators around the world. This could lead to new regulations that could impact the company’s business.\n\nInsider selling: Meta’s management team have been selling more shares than buying. This may be independent to the performance of the company, but does not inspire confidence.\n\nAm I buying Meta shares?\n\nI am not currently buying additional shares in Meta. While the company has strong growth prospects, I think the Meta share price has risen quickly enough to take some profits. I will wait for a pullback before considering buying more shares.\n\nThe post My Meta shares are up 114%. Should I take profits or buy more? appeared first on The Motley Fool UK.\n\nMore reading\n\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Gordon Best has positions in Meta Platforms. The Motley Fool UK has recommended Meta Platforms. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro. Here at The Motley Fool we believe that considering a diverse range of insights makes us better investors.\n\nMotley Fool UK 2023"
}