{
    "datasource_id": "Facebook took action on about a quarter of individual grievances, Instagram on 40% in May@Deccan Herald@Meta",
    "data": "Social media giant Meta's Facebook took action against only around 27 per cent of complaints it received from users and Instagram against less than half of total grievances raised by users in May 2023, according to the company's latest India Monthly Report.\nIndividual grievances on Facebook more than doubled to 16,995 and jumped over 68 per cent on Instagram in May compared to April data.\nAs per the category-wise information disclosed by Meta, Facebook \"actioned on\" less than one-tenth grievances of users where they claimed that the content is showing them in partial nudity or in a sexual act.\nAlso Read | Elon Musk slaps limit on number of tweets users can read; know what it means\nIn the case of Instagram, the platform acted on half of the total users' reports it received for violation of its policy on \"content showing me in nudity/partial nudity or in a sexual act\".\nMeta transparency report shows the other categories of report, on which Facebook action rate was less than a quarter of percentage, included grievances raised by users for \"bullying or harassment\" (less than 7 per cent), \"inappropriate or abusive content\" (about 8 per cent) and fake profiles (about 48 per cent).\nFacebook received a total 16,995 grievances from users and provided tools for users to resolve their issues in 2,325 cases.\n\"Of the other 14,670 reports where specialized review was needed, we reviewed content as per our policies, and we took action on 2,299 reports in total,\" Meta said in its report for Facebook.\nThe category-wise details of action taken on 2,299 additional reports was not disclosed by Facebook.\nInstagram received 16,267 grievances from users, out of which it acted on 6,499 incidents comprising 2,671 reports on which action was taken after specialised review.\nInstagram provided tools only in around 5 per cent of cases where users reported about their account being hacked, around 50 per cent in cases where users claimed that the content showed them in partial nudity or in a sexual act.\nThe category or the policy wise details of 2,671 reports were not shared by the company in the report.\nMeta received two orders from Grievances Appellate Committee (GAC) on which it acted.\nThe GAC looks into complaints of users who are not satisfied by the resolution of social media majors."
}