{
    "datasource_id": "Meta Has An AI Problem: A Third Of Its Researchers Have Left The Company In The Past Year@World Nation News@2023-06-23 17:34:29.959826@Meta",
    "data": "Mark Zuckerberg, CEO of Meta (the parent company of Facebook, Instagram and WhatsApp), once invested heavily in the development of artificial intelligence, but Tech giants may be left behind After massive layoffs and the departure of many researchers from the company.\nAs AI continues to evolve, Meta seeks to pit itself against industry leaders such as OpenAI (the developer of ChatGPT). However, this task may be difficult for you after losing at least a third of its investigators acquired expertise in artificial intelligence during the last year, as stated in wall street journal,\nIn 2013, Zuckerberg recruited one of the Guardian of AI, directing Meta’s efforts to advance in that area, but recently The White House kicked the company off its guest list At the summit of “Organizations at the forefront of innovation in artificial intelligence”.\nThe company says it is currently working to fix missteps that have shifted focus away from generic AI, despite its own employees asking their managers to move in that new direction . wall street journal,\nAccording to sources, under the orders of Lecan, the investigators consulted this means of communication they found it difficult to promote larger linguistic models So that programs like ChatGPT are possible. Instead, in a meeting with workers this month, Zuckerberg praised employees for advances in artificial intelligence.\n“In the last year, We’ve seen some really amazing progressQualitative progress in Generative AI”, said the CEO of Meta.\nThe company has lost several researchers this year who may have expressed doubts or felt discouraged about the organization’s future. according to him wall street journalWhen OpenAI launched ChatGPT in November and significantly accelerated the race to innovate in AI, even more employees left.\nIn an internal survey conducted between April 26 and May 10, only 26% workers De Meta assured that he has confidence in Mark Zuckerberg and the company’s management.\nZuckerberg named 2023 “Year of Efficiency” In the presentation of quarterly results held in February. Facebook’s parent company laid off more than 11,000 employees in November Projects continue to be canceled in the following months."
}