{
    "datasource_id": "Meta Will Launch Twitter Competitor In Mid-July: Report@Forbes@2023-06-23 17:34:29.954825@Meta",
    "data": "SpaceX, Twitter and electric car maker Tesla CEO Elon Musk in Paris on June 16, 2023 (R) and ... [+] Facebook founder Mark Zuckerberg testifying before the House Financial Services Committee in the Rayburn House Office Building in Washington, DC on October 23, 2019. (Photo by Mandel NGAN and Alain JOCARD / AFP) (Photo by MANDEL NGAN,ALAIN JOCARD/AFP via Getty Images) AFP via Getty Images\nMeta, the parent company of Facebook, plans to launch its short-form blogging service in mid-July, according to a new report from technology website the Verge. The website is known as Project 92 internally at could be launched to consumers this summer with the name Threads.\nThreads, assuming they call it that, has been in development for some time, with the first reports about its existence leaking out back in March. But details were scarce and there’s still a lot we don’t know about the new social media platform.\nOne thing we do know is that Meta will be promoting Threads inside of Instagram, according to the Verge, which will be a huge boost to the social media platform’s visibility. In fact, Meta hopes the Twitter competitor could attract “tens of millions” of users in just a few months.\nMeta has also apparently been reaching out to unnamed big celebrities who are being pitched on Threads as a “sanely run” platform, according to the Verge. Meta is positioning itself as the responsible alternative to the chaos of Twitter, which has been on a rollercoaster of new policies and edits since Elon Musk bought the company back in October 2022.\nMusk welcomed back to Twitter a number of previously banned high-profile figures, including Republican political advisor Roger Stone and Kanye West. The latter personality only lasted a short while before he started posting anti-semitic messages before the musician was banned again.\nBut Twitter has been trying to right the ship in recent months, bringing on Linda Yaccarino as CEO to help assure advertisers that grown ups are in charge. And while Yaccarino has pledged to uphold the same free-speech spirit that Musk has said he champions, her vast experience in the ad world will likely be a sigh of relief to many brands that may have gotten squeamish after Musk bought the company.\nAs CNBC recently reported, Threads is being touted as a “decentralized” social media network that will have some integrations with the social media platform Mastodon, but details on what that will entail haven’t been released.\nMeta’s plans have not been welcomed by Musk. In fact, the billionaire plans to stage a cage fight with Mark Zuckerberg after the two men started a war of words in the wake of news leaking about Threads. It’s still unclear whether the fight will actually happen. But both tech titans have made it clear they’re not huge fans of each other.\nMeta did not immediately respond to questions emailed Friday night. I’ll update this post if I hear back with any news."
}