{
    "datasource_id": "Meta Introduces Generative AI Model ‘Voicebox’ To Revolutionise Field of Speech Generation@Fresh Headline@2023-06-18 22:42:09.726920@Meta",
    "data": "San Francisco, June 18: Meta has developed a cutting-edge generative AI model ‘Voicebox’, designed to revolutionise the field of speech generation.\n\n“We’ve developed Voicebox, the first model that can generalise to speech-generation tasks it was not specifically trained to accomplish with state-of-the-art performance,” Meta said in a blogpost. Meta Launches New Platform ‘Take It Down’ To Prevent Minors’ Intimate Images Spreading Online.\n\nAccording to the company, Voicebox generates images and text in a variety of styles, and it can create outputs from scratch or modify samples provided to it. However, instead of creating a picture or a passage of text, Voicebox produces high-quality audio clips.\n\nThe model supports speech synthesis across six languages, including English, French, German, Spanish, Polish, and Portuguese, as well as performs noise removal, content editing, style conversion, and diverse sample generation. Meta Introduces Improved Avatars With New Body Shapes, Hair, Clothing Textures To Help Users To Better Express Themselves.\n\nMoreover, Meta said that Voicebox uses a new approach to learn just from raw audio and an accompanying transcription. Unlike autoregressive models for audio generation, Voicebox can modify any part of a given sample, not just the end of an audio clip it is given.\n\nFurther, the tech giant said that Voicebox is trained to predict a speech segment when given the surrounding speech and the transcript of the segment.\n\nOnce the model has learned to infill speech from context, it can be applied across a wide range of speech generation tasks, including generating portions of an audio recording without re-creating the entire recording.\n\nThis versatility enables Voicebox to perform well across a variety of tasks, including — in-context text-to-speech synthesis, cross-lingual style transfer, speech denoising and editing, and diverse speech sampling.\n\n(The above story first appeared on Fresh Headline on Jun 18, 2023 03:35 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website freshheadline.com)."
}