{
    "datasource_id": "Warren Buffett's $151 Billion Gamble: Customers Won't Trade Their Apple iPhones For $10,000, And Here's Why@Yahoo Finance@2023-06-15 14:54:34.481606@Apple",
    "data": "Legendary investor Warren Buffett, an ardent supporter of Apple Inc. stock, has highlighted the company’s exceptionally devoted customer base as a key factor in his admiration. According to Buffett, iPhone users display such unwavering brand loyalty that they would not permanently part ways with their phones even if offered $10,000.\nDon't Miss: Why Silicon Valley Elites Are Betting On This Startups Vision For Re-Uniting American Families\nBerkshire Hathaway Inc., the investment conglomerate Buffett leads, holds the largest equity investment in Apple, owning 915 million shares valued at $151 billion. This investment constitutes approximately 6% of Berkshire’s portfolio. Apple represents around 44% of Berkshire’s overall equity portfolio, which amounts to $344 billion, according to CNBC’s Berkshire portfolio tracker.\nDuring an interview with CNBC's Squawk Box, the 92-year-old Buffett drew a contrast between the loyalty of iPhone users and the behavior of automobile buyers.\n“If you’re an Apple user and somebody offers you $10,000 but the only provision is that they’ll take away your iPhone and you’ll never be able to buy another, you’re not gonna take it,” he said.\nDrawing a contrasting analogy, Buffett emphasized how consumers’ behavior might differ when faced with a similar proposition involving a different product.\n“If they tell you if you buy another Ford car, they’ll give you $10,000 not to do that, you’ll take the $10,000, and you’ll buy a Chevy instead,” he said\nTo stay updated with top startup news & investments, sign up for Benzinga's Startup Investing & Equity Crowdfunding Newsletter\nBuffett’s perspective on Apple extends beyond its status as a technology company. He also considers it a consumer-oriented business. His initial interest in purchasing Apple stock in 2016 stemmed from observing his grandchildren’s fascination with their iPhones during visits to an Omaha Dairy Queen, a company owned by Berkshire.\nBuffett went on to highlight the remarkable nature of Apple’s success, crediting it to the groundbreaking products pioneered by the late Steve Jobs, with CEO Tim Cook successfully steering the company to new heights.\n“Tim Cook has managed that company in an extraordinary way,” Buffett said.\nThe astute investor drew a parallel to his own business ventures, citing the vast value of Burlington Northern Santa Fe, a prominent railroad company, and Berkshire Hathaway Energy, a substantial utility business. In Buffett’s eyes, these enterprises hold comparable significance to Apple, demonstrating the scale and potential of the tech giant.\nSome may question the decision to concentrate such a significant portion of Berkshire Hathaway’s portfolio in one stock, particularly when it comes to Apple. But Buffett swiftly dismisses any doubts, emphasizing the unparalleled nature of Apple’s business.\nSee Next: New Battery Beats Tesla’s Lithium-Ion By A Mile With 50% Cheaper Price Tag, 99% Recyclable and Three Times Longer Lifespan\n“We can’t develop a business like that,” he said. Hence, Berkshire Hathaway has acquired a substantial stake in Apple, a position that continues to grow incrementally each year because of Apple’s own stock buybacks.\nBuffett’s profound appreciation for Apple is undeniable. In his own words, Buffett sums up his sentiment by stating, “It’s a wonderful business so we own a lot of it.”\nBuffett’s History of Success\nBuffett is considered one of the best investors in modern history, and his record speaks for itself. From being an early investor in GEICO (now owned by Berkshire Hathaway) to becoming an early investor in American Express Company, Buffett has had a long history of success. One of his keys to success has been finding companies with a lot of potential and then investing for the long term. The barriers to investing like Buffett are constantly being broken down. Thanks to changes in federal law, investors can even own shares in startups and private companies on platforms like StartEngine, including investing in StartEngine itself.\nSee more on startup investing from Benzinga.\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\nThis article Warren Buffett's $151 Billion Gamble: Customers Won't Trade Their Apple iPhones For $10,000, And Here's Why originally appeared on Benzinga.com\n.\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
}