{
    "datasource_id": "Apple to Release ‘Argylle’ Theatrically in Partnership with Universal@IndieWire@2023-06-15 12:54:34.504252@Apple",
    "data": "Like “Killers of the Flower Moon” and “Napoleon” before it, a third Apple movie, “Argylle,” will get a wide theatrical release before heading to streamer Apple TV+. Also like the other two, Matthew Vaughn’s spy thriller starring Henry Cavill has its own unique theatrical-distribution partner: Universal Pictures.\nMartin Scorsese’s “Killers,” released by Paramount Pictures, and Ridley Scott’s “Napoleon,” distributed by Sony, will both hit theaters this fall. “Argylle” will open in theaters on February 2, 2024; we do not yet have streaming-premiere dates for any of the three.\nJumping around between theatrical-distribution partners is an unusual strategy. One would expect that Apple would cut a deal with one theatrical partner, but that hasn’t happened — yet — and it’s starting to feel like tryouts.\nAlternatively, Apple could easily just buy a studio; it’s the world’s largest company by market cap. Apple rival Amazon, the second-largest company in the world by market cap, purchased MGM for $8.5 billion in March 2022 to help fuel its own sizable theatrical ambitions.\nLike the Sony deal for “Napoleon,” it is not clear if the Apple-Universal partnership is a one-off for “Argylle” or a sign of more to come between the two players. When reached by IndieWire, a rep for Apple had no comment on that very question. “Killers of the Flower Moon,” from Martin Scorsese, originated at Paramount — so that explains that particular partnership.\nAlso unclear is if “Argylle” will be released under the same arrangement Universal has with its other theatrical releases, in which movies that fall below a certain box-office threshold can be released on PVOD after just 17 days — or three weekends. We asked; Universal didn’t respond.\nWhat we do know, at least according to a report, is that Apple is planning to invest $1 billion annually into movies with theatrical releases. Another big one is Joseph Kosinski’s still-untitled Formula One racing movie starring Brad Pitt. When reached, Apple would not disclose which studio or distributor — if any — would get the nod to pair up on that one.\n“Napoleon” Courtesy of Apple\nVaughn directed and produced “Argylle.” In addition to Cavill, the impressive cast also includes Bryce Dallas Howard, Sam Rockwell, Bryan Cranston, Catherine O’Hara, John Cena, Dua Lipa, Ariana DeBose, and Samuel L. Jackson.\n“Argylle” is based on a script written by Jason Fuchs. The film is produced by Cloudy Productions and Vaughn’s regular collaborators Adam Bohling and David Reid, as well as Fuchs. Zygi Kamasa, Carlos Peres, Claudia Vaughn, and Adam Fishbach serve as executive producers."
}