{
    "datasource_id": "Apple Inc. (NASDAQ:AAPL) Shares Sold by Port Capital LLC@Defense World@2023-06-15 19:54:34.506418@Apple",
    "data": "Port Capital LLC lowered its stake in Apple Inc. (NASDAQ:AAPL – Get Rating) by 2.1% during the fourth quarter, according to its most recent 13F filing with the SEC. The firm owned 65,978 shares of the iPhone maker’s stock after selling 1,399 shares during the quarter. Port Capital LLC’s holdings in Apple were worth $8,573,000 as of its most recent filing with the SEC.\nA number of other institutional investors have also recently added to or reduced their stakes in the stock. MKT Advisors LLC grew its stake in Apple by 0.5% in the 2nd quarter. MKT Advisors LLC now owns 12,269 shares of the iPhone maker’s stock valued at $1,777,000 after acquiring an additional 60 shares during the period. Adaptive Financial Consulting LLC boosted its stake in Apple by 2.7% during the 4th quarter. Adaptive Financial Consulting LLC now owns 2,606 shares of the iPhone maker’s stock worth $339,000 after purchasing an additional 68 shares during the last quarter. Silver Oak Advisory Group Inc. boosted its stake in Apple by 1.8% during the 2nd quarter. Silver Oak Advisory Group Inc. now owns 3,925 shares of the iPhone maker’s stock worth $537,000 after purchasing an additional 69 shares during the last quarter. 3D L Capital Management LLC boosted its stake in Apple by 2.9% during the 1st quarter. 3D L Capital Management LLC now owns 2,445 shares of the iPhone maker’s stock worth $427,000 after purchasing an additional 70 shares during the last quarter. Finally, Weik Capital Management boosted its stake in Apple by 0.3% during the 1st quarter. Weik Capital Management now owns 25,238 shares of the iPhone maker’s stock worth $4,407,000 after purchasing an additional 70 shares during the last quarter. Institutional investors and hedge funds own 57.60% of the company’s stock.\nGet Apple alerts:\nAnalyst Upgrades and Downgrades\nSeveral equities research analysts have issued reports on the stock. Robert W. Baird lifted their target price on shares of Apple from $170.00 to $180.00 in a research note on Tuesday, May 2nd. Barclays boosted their price target on shares of Apple from $145.00 to $149.00 and gave the company an “equal weight” rating in a research report on Wednesday, April 26th. DA Davidson cut shares of Apple from a “buy” rating to a “neutral” rating and lowered their price target for the company from $193.00 to $185.00 in a research report on Monday, June 5th. Morgan Stanley boosted their price target on shares of Apple from $185.00 to $190.00 in a research report on Friday, June 2nd. Finally, Piper Sandler lowered their price target on shares of Apple from $195.00 to $180.00 and set an “overweight” rating on the stock in a research report on Friday, May 5th. Two research analysts have rated the stock with a sell rating, eight have issued a hold rating and twenty-four have assigned a buy rating to the company’s stock. According to MarketBeat.com, the stock has an average rating of “Moderate Buy” and a consensus target price of $177.40.\nApple Price Performance\nApple stock opened at $183.95 on Thursday. The company has a market cap of $2.89 trillion, a P/E ratio of 31.23, a price-to-earnings-growth ratio of 2.42 and a beta of 1.29. The business has a fifty day moving average of $171.77 and a two-hundred day moving average of $154.62. Apple Inc. has a one year low of $124.17 and a one year high of $184.95. The company has a debt-to-equity ratio of 1.56, a quick ratio of 0.88 and a current ratio of 0.94.\nApple (NASDAQ:AAPL – Get Rating) last posted its quarterly earnings data on Thursday, May 4th. The iPhone maker reported $1.52 EPS for the quarter, topping analysts’ consensus estimates of $1.44 by $0.08. The firm had revenue of $94.84 billion during the quarter, compared to analysts’ expectations of $92.84 billion. Apple had a return on equity of 165.72% and a net margin of 24.49%. The firm’s quarterly revenue was down 2.5% compared to the same quarter last year. During the same quarter last year, the business posted $1.52 EPS. As a group, analysts predict that Apple Inc. will post 5.99 earnings per share for the current fiscal year.\nApple Increases Dividend\nThe firm also recently declared a quarterly dividend, which was paid on Thursday, May 18th. Shareholders of record on Monday, May 15th were issued a $0.24 dividend. This is a boost from Apple’s previous quarterly dividend of $0.23. The ex-dividend date was Friday, May 12th. This represents a $0.96 annualized dividend and a yield of 0.52%. Apple’s payout ratio is 16.30%.\nApple declared that its board has approved a stock repurchase program on Thursday, May 4th that authorizes the company to buyback $90.00 billion in outstanding shares. This buyback authorization authorizes the iPhone maker to purchase up to 3.4% of its shares through open market purchases. Shares buyback programs are often a sign that the company’s board believes its stock is undervalued.\nInsider Buying and Selling at Apple\nIn other Apple news, CEO Timothy D. Cook sold 56,072 shares of Apple stock in a transaction dated Monday, April 3rd. The stock was sold at an average price of $165.17, for a total value of $9,261,412.24. Following the completion of the sale, the chief executive officer now owns 3,280,052 shares in the company, valued at approximately $541,766,188.84. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this link. In other news, COO Jeffrey E. Williams sold 187,730 shares of the business’s stock in a transaction dated Wednesday, March 22nd. The stock was sold at an average price of $159.76, for a total transaction of $29,991,744.80. Following the completion of the sale, the chief operating officer now owns 489,816 shares in the company, valued at approximately $78,253,004.16. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC website. Also, CEO Timothy D. Cook sold 56,072 shares of the business’s stock in a transaction dated Monday, April 3rd. The stock was sold at an average price of $165.17, for a total value of $9,261,412.24. Following the sale, the chief executive officer now owns 3,280,052 shares of the company’s stock, valued at approximately $541,766,188.84. The disclosure for this sale can be found here. Insiders sold 439,529 shares of company stock worth $71,703,657 in the last 90 days. 0.06% of the stock is owned by company insiders.\nAbout Apple\n(Get Rating)\nApple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.\nSee Also\nWant to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Get Rating).\nReceive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter."
}