{
    "datasource_id": "Pacific Capital Wealth Advisors Inc. Reduces Stake in Apple Inc. (NASDAQ:AAPL)@Defense World@2023-06-15 19:54:34.508887@Apple",
    "data": "Pacific Capital Wealth Advisors Inc. lessened its stake in shares of Apple Inc. (NASDAQ:AAPL – Get Rating) by 16.1% during the 4th quarter, according to the company in its most recent filing with the Securities & Exchange Commission. The firm owned 24,502 shares of the iPhone maker’s stock after selling 4,698 shares during the period. Apple accounts for approximately 0.8% of Pacific Capital Wealth Advisors Inc.’s portfolio, making the stock its 27th biggest position. Pacific Capital Wealth Advisors Inc.’s holdings in Apple were worth $3,184,000 at the end of the most recent reporting period.\nSeveral other institutional investors and hedge funds have also recently modified their holdings of AAPL. Robinson Value Management Ltd. purchased a new stake in shares of Apple in the 3rd quarter valued at approximately $28,000. St. James Investment Advisors LLC lifted its holdings in Apple by 98.3% in the fourth quarter. St. James Investment Advisors LLC now owns 236 shares of the iPhone maker’s stock valued at $31,000 after acquiring an additional 117 shares during the last quarter. Hanseatic Management Services Inc. grew its position in Apple by 75.4% in the third quarter. Hanseatic Management Services Inc. now owns 249 shares of the iPhone maker’s stock worth $34,000 after acquiring an additional 107 shares during the period. HBC Financial Services PLLC increased its stake in Apple by 21.7% during the first quarter. HBC Financial Services PLLC now owns 448 shares of the iPhone maker’s stock worth $49,000 after acquiring an additional 80 shares during the last quarter. Finally, Align Wealth Management LLC purchased a new stake in Apple in the fourth quarter valued at $55,000. Institutional investors and hedge funds own 57.60% of the company’s stock.\nGet Apple alerts:\nApple Stock Up 0.3 %\nShares of Apple stock opened at $183.95 on Thursday. The company has a market cap of $2.89 trillion, a P/E ratio of 31.23, a PEG ratio of 2.42 and a beta of 1.29. The firm has a fifty day moving average of $171.77 and a two-hundred day moving average of $154.62. The company has a debt-to-equity ratio of 1.56, a quick ratio of 0.88 and a current ratio of 0.94. Apple Inc. has a one year low of $124.17 and a one year high of $184.95.\nApple ( NASDAQ:AAPL Get Rating ) last posted its quarterly earnings results on Thursday, May 4th. The iPhone maker reported $1.52 earnings per share (EPS) for the quarter, topping the consensus estimate of $1.44 by $0.08. Apple had a net margin of 24.49% and a return on equity of 165.72%. The firm had revenue of $94.84 billion during the quarter, compared to analysts’ expectations of $92.84 billion. During the same period in the prior year, the company posted $1.52 earnings per share. The firm’s revenue for the quarter was down 2.5% on a year-over-year basis. On average, analysts forecast that Apple Inc. will post 5.99 earnings per share for the current year.\nApple declared that its Board of Directors has authorized a share buyback program on Thursday, May 4th that allows the company to buyback $90.00 billion in shares. This buyback authorization allows the iPhone maker to purchase up to 3.4% of its shares through open market purchases. Shares buyback programs are often an indication that the company’s board of directors believes its stock is undervalued.\nApple Increases Dividend\nThe firm also recently declared a quarterly dividend, which was paid on Thursday, May 18th. Investors of record on Monday, May 15th were paid a $0.24 dividend. The ex-dividend date was Friday, May 12th. This is an increase from Apple’s previous quarterly dividend of $0.23. This represents a $0.96 dividend on an annualized basis and a dividend yield of 0.52%. Apple’s payout ratio is 16.30%.\nInsider Buying and Selling\nIn other Apple news, CEO Timothy D. Cook sold 56,072 shares of the firm’s stock in a transaction on Monday, April 3rd. The stock was sold at an average price of $165.17, for a total value of $9,261,412.24. Following the completion of the sale, the chief executive officer now owns 3,280,052 shares of the company’s stock, valued at $541,766,188.84. The transaction was disclosed in a filing with the SEC, which is available through this hyperlink. In related news, SVP Deirdre O’brien sold 43,622 shares of the business’s stock in a transaction dated Monday, April 3rd. The shares were sold at an average price of $165.41, for a total value of $7,215,515.02. Following the sale, the senior vice president now directly owns 136,444 shares in the company, valued at approximately $22,569,202.04. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this link. Also, CEO Timothy D. Cook sold 56,072 shares of the firm’s stock in a transaction dated Monday, April 3rd. The shares were sold at an average price of $165.17, for a total transaction of $9,261,412.24. Following the transaction, the chief executive officer now owns 3,280,052 shares of the company’s stock, valued at $541,766,188.84. The disclosure for this sale can be found here. Insiders have sold 439,529 shares of company stock valued at $71,703,657 over the last quarter. Company insiders own 0.06% of the company’s stock.\nAnalyst Ratings Changes\nA number of brokerages recently issued reports on AAPL. Morgan Stanley raised their price objective on Apple from $185.00 to $190.00 in a research report on Friday, June 2nd. StockNews.com started coverage on shares of Apple in a research report on Thursday, May 18th. They set a “hold” rating for the company. Atlantic Securities upped their price objective on shares of Apple from $180.00 to $200.00 and gave the stock an “overweight” rating in a report on Friday, May 5th. Robert W. Baird boosted their target price on Apple from $170.00 to $180.00 in a research report on Tuesday, May 2nd. Finally, 58.com restated a “maintains” rating on shares of Apple in a research report on Monday, June 5th. Two analysts have rated the stock with a sell rating, eight have issued a hold rating and twenty-four have given a buy rating to the company. According to MarketBeat, the company presently has an average rating of “Moderate Buy” and an average price target of $177.40.\nApple Profile\n(Get Rating)\nApple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.\nFeatured Articles\nWant to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Get Rating).\nReceive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter."
}