{
    "datasource_id": "Probity Advisors Inc. Has $1.21 Million Stake in Apple Inc. (NASDAQ:AAPL)@Defense World@2023-06-15 18:54:34.512486@Apple",
    "data": "Probity Advisors Inc. boosted its stake in Apple Inc. (NASDAQ:AAPL – Get Rating) by 4.0% in the fourth quarter, according to its most recent Form 13F filing with the Securities & Exchange Commission. The firm owned 9,283 shares of the iPhone maker’s stock after purchasing an additional 359 shares during the period. Probity Advisors Inc.’s holdings in Apple were worth $1,206,000 at the end of the most recent reporting period.\nA number of other institutional investors and hedge funds have also bought and sold shares of the stock. Moneta Group Investment Advisors LLC boosted its position in Apple by 116,483.5% during the fourth quarter. Moneta Group Investment Advisors LLC now owns 569,554,722 shares of the iPhone maker’s stock valued at $74,002,245,000 after acquiring an additional 569,066,184 shares during the last quarter. Norges Bank bought a new position in shares of Apple during the 4th quarter worth about $21,746,940,000. Morgan Stanley boosted its position in shares of Apple by 14.2% during the 4th quarter. Morgan Stanley now owns 208,655,323 shares of the iPhone maker’s stock worth $27,110,586,000 after purchasing an additional 25,926,552 shares in the last quarter. Barclays PLC boosted its position in shares of Apple by 53.0% during the 3rd quarter. Barclays PLC now owns 30,235,823 shares of the iPhone maker’s stock worth $4,178,590,000 after purchasing an additional 10,471,342 shares in the last quarter. Finally, Vanguard Group Inc. boosted its position in shares of Apple by 0.7% during the 1st quarter. Vanguard Group Inc. now owns 1,269,995,750 shares of the iPhone maker’s stock worth $221,753,959,000 after purchasing an additional 8,734,393 shares in the last quarter. 57.60% of the stock is currently owned by institutional investors and hedge funds.\nGet Apple alerts:\nAnalyst Ratings Changes\nAAPL has been the topic of a number of research analyst reports. DA Davidson cut shares of Apple from a “buy” rating to a “neutral” rating and cut their price objective for the stock from $193.00 to $185.00 in a research report on Monday, June 5th. KeyCorp raised their price target on shares of Apple from $177.00 to $180.00 and gave the company an “overweight” rating in a research report on Friday, May 5th. Atlantic Securities raised their price target on shares of Apple from $180.00 to $200.00 and gave the company an “overweight” rating in a research report on Friday, May 5th. 58.com reaffirmed a “maintains” rating on shares of Apple in a research report on Monday, June 5th. Finally, Loop Capital cut shares of Apple from a “buy” rating to a “hold” rating and set a $180.00 price target on the stock. in a research report on Monday, May 22nd. Two equities research analysts have rated the stock with a sell rating, eight have assigned a hold rating and twenty-four have issued a buy rating to the company. According to data from MarketBeat, the company currently has an average rating of “Moderate Buy” and an average target price of $177.40.\nInsider Activity at Apple\nApple Stock Performance\nIn related news, COO Jeffrey E. Williams sold 187,730 shares of the business’s stock in a transaction dated Wednesday, March 22nd. The shares were sold at an average price of $159.76, for a total transaction of $29,991,744.80. Following the transaction, the chief operating officer now owns 489,816 shares in the company, valued at $78,253,004.16. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this link . In related news, COO Jeffrey E. Williams sold 187,730 shares of the business’s stock in a transaction dated Wednesday, March 22nd. The shares were sold at an average price of $159.76, for a total transaction of $29,991,744.80. Following the sale, the chief operating officer now owns 489,816 shares of the company’s stock, valued at $78,253,004.16. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this hyperlink . Also, insider Chris Kondo sold 4,092 shares of the business’s stock in a transaction dated Monday, May 8th. The stock was sold at an average price of $173.26, for a total transaction of $708,979.92. Following the sale, the insider now directly owns 33,946 shares in the company, valued at approximately $5,881,483.96. The disclosure for this sale can be found here . Insiders have sold 439,529 shares of company stock worth $71,703,657 over the last 90 days. 0.06% of the stock is owned by company insiders.\nNASDAQ AAPL opened at $183.95 on Thursday. The company has a fifty day moving average of $171.77 and a 200-day moving average of $154.62. Apple Inc. has a 52-week low of $124.17 and a 52-week high of $184.95. The company has a market capitalization of $2.89 trillion, a P/E ratio of 31.23, a P/E/G ratio of 2.42 and a beta of 1.29. The company has a debt-to-equity ratio of 1.56, a quick ratio of 0.88 and a current ratio of 0.94.\nApple (NASDAQ:AAPL – Get Rating) last announced its quarterly earnings results on Thursday, May 4th. The iPhone maker reported $1.52 earnings per share (EPS) for the quarter, beating the consensus estimate of $1.44 by $0.08. Apple had a net margin of 24.49% and a return on equity of 165.72%. The company had revenue of $94.84 billion for the quarter, compared to analysts’ expectations of $92.84 billion. During the same quarter in the previous year, the company earned $1.52 earnings per share. Apple’s quarterly revenue was down 2.5% on a year-over-year basis. As a group, equities research analysts predict that Apple Inc. will post 5.99 EPS for the current fiscal year.\nApple Increases Dividend\nThe business also recently declared a quarterly dividend, which was paid on Thursday, May 18th. Investors of record on Monday, May 15th were given a dividend of $0.24 per share. The ex-dividend date of this dividend was Friday, May 12th. This represents a $0.96 annualized dividend and a dividend yield of 0.52%. This is a boost from Apple’s previous quarterly dividend of $0.23. Apple’s payout ratio is currently 16.30%.\nApple declared that its Board of Directors has initiated a stock repurchase program on Thursday, May 4th that permits the company to repurchase $90.00 billion in outstanding shares. This repurchase authorization permits the iPhone maker to reacquire up to 3.4% of its stock through open market purchases. Stock repurchase programs are usually an indication that the company’s board believes its stock is undervalued.\nApple Profile\n(Get Rating)\nApple Inc designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod.\nFurther Reading\nWant to see what other hedge funds are holding AAPL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for Apple Inc. (NASDAQ:AAPL – Get Rating).\nReceive News & Ratings for Apple Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Apple and related companies with MarketBeat.com's FREE daily email newsletter."
}